{"State Machines":["AASM is a continuation of the acts as state machine rails plugin, built for plain Ruby objects.","AlterEgo is a Ruby implementation of the State pattern as described by the Gang of Four. It differs from other Ruby state machine libraries in that it focuses on providing polymorphic behavior based on object state. In effect, it makes it easy to give an object different personalities depending on the state it is in.","Adds finite state machine behaviour to Ruby classes. Meant as an alternative to acts_as_state_machine/AASM.","There are many finite state machine implementations for Ruby, and they all provide a nice DSL for declaring events, exceptions, callbacks, and all kinds of niceties in general. But if all you want is a finite state machine, look no further: this has less than 50 lines of code and provides everything a finite state machine must have, and nothing more.","ruote is an open source Ruby workflow engine","A simple DSL to decorate existing methods with state transition guards.","[description]","Stamina is an automaton and regular inference toolkit initially developped for the baseline of the Stamina Competition (stamina.chefbe.net).","State machine that allows dynamic transitions for business workflows","A rich library for state-oriented programming with state machines / workflows","Adds support for creating state machines for attributes on any Ruby class","ActiveRecord Model Status Manager, It provides easy ways for managing ActiveModels that have many statuses.","Lightweight state machine extracted from ActiveModel","Workflow is a finite-state-machine-inspired API for modeling and interacting with what we tend to refer to as 'workflow'. * nice DSL to describe your states, events and transitions * robust integration with ActiveRecord and non relational data stores * various hooks for single transitions, entering state etc. * convenient access to the workflow specification: list states, possible events for particular state"],"Rails Admin Interfaces":["Simple and real-life tested Rails::Engine admin interface","The administration framework for Ruby on Rails.","Save time and headaches, and create a more easily maintainable set of pages, with ActiveScaffold. ActiveScaffold handles all your CRUD (create, read, update, delete) user interface needs, leaving you more time to focus on more challenging (and interesting!) problems.","admin_assistant is a Rails plugin that automates a lot of features typically needed in admin interfaces.","Manage data as if you own it","A Rails admin interface generator. Theme stolen from Redmine. Similar to web-app-theme but better ;).","Easy Admin Interfaces for Rails","Generates simple and extendable controller, views and helpers that support you to DRY up the CRUD code in your Rails project. Start with these elements and build a clean base to efficiently develop your application upon.","Administration interface framework for fullstack","Inline Forms aims to ease the setup of forms that provide inline editing. The field list can be specified in the model.","Lipsiadmin is a new revolutionary admin for your projects.Lipsiadmin is based on Ext Js 2.0. framework (with prototype adapter) and is ready for Rails 2.0. This admin is for newbie developper but also for experts, is not entirely written in javascript because the aim of developper wose build in a agile way web/site apps so we use extjs in a new intelligent way a mixin of 'old' html and new ajax functions, for example ext manage the layout of page, grids, tree and errors, but form are in html code.","Admin interface builder","An [almost] one command solution for adding admin interfaces/resources to a Rails app.","RailsAdmin is a Rails engine that provides an easy-to-use interface for managing your data.","","Ruby on Rails Admin Panel (Engine) to allow trusted users edit structured content."],"A/B Testing":["","Incorperate AB Testing into your rails apps","Absurdly simple a/b testing","Bandit provides a way to do multi-armed bandit optimization of alternatives in a rails website","Ruby client for the FluidFeatures service.","Ruby on Rails client for the FluidFeatures service.","ab testing for rails","Rack based split testing framework","To ensure Validations that continue to have issues are addressed by developers. This is done by logging the failure. When a specific failure continues to be an issue, a developer can look into the problem.","Mirror, mirror on the wall ..."],"CLI Option Parsers":["Command-line option parser and command interface.","It's just here to handle arguments provided to Application. Mainly optional via switches. Currently handles plain-text Console arguments.","Choice is a simple little gem for easily defining and parsing command line options with a friendly DSL.","Clamp provides an object-model for command-line utilities. It handles parsing of command-line options, and generation of usage help.","Clap is a small library that can be bundled with your command line application. It covers the simple case of executing code based on the flags or parameters passed.","cmdparse provides classes for parsing commands on the command line; command line options are parsed using optparse or any other option parser implementation. Programs that use such command line interfaces are, for example, subversion's 'svn' or Rubygem's 'gem' program.","A small library for doing (command) lines","The complete solution for Ruby command-line executables. Commander bridges the gap between other terminal related libraries you know and love (OptionParser, HighLine), while providing many new features, and an elegant API.","Parse command-line options into a configuration hash","Cri allows building easy-to-use commandline interfaces with support for subcommands.","Isn't it awesome how `optparse` and other option parsers generate help and usage-messages based on your code?! Hell no! You know what's awesome? It's when the option parser *is* generated based on the help and usage-message that you write in a docstring! That's what docopt does!","The getopt library provides two different command line option parsers. They are meant as easier and more convenient replacements for the command line parsers that ship as part of the Ruby standard library. Please see the README for additional comments.","Yet another command line option parser in Ruby, based on Perl's Getopt::Long module.","Build command-suite CLI apps that are awesome. Bootstrap your app, add commands, options and documentation while maintaining a well-tested idiomatic command-line app","A high-level IO library that provides validation, type conversion, and more for command-line interfaces. HighLine also includes a complete menu system that can crank out anything from simple list selection to complete shells with just minutes of work.","Methadone provides a lot of small but useful features for developing a command-line app, including an opinionated bootstrapping process, some helpful cucumber steps, and some classes to bridge logging and output into a simple, unified, interface","This is an lightweight option parser, which is less than 80 lines short. It has strong validations and a short, clear and easy to use syntax. Feel free to copy all 80 lines (55 lines without validations / empty lines) into your script rather installing the gem.","A simple mixin for CLI interfaces, including option parsing","A flexible command line option parser.","Sensible options parsing","Quickl helps you creating commandline ruby programs. From simple commands with options to complex delegators with subcommands, global and local options.","A simple DSL for gathering options and parsing the command line","Trollop is a commandline option parser for Ruby that just gets out of your way. One line of code per option is all you need to write. For that, you get a nice automatically-generated help page, robust option parsing, command subcompletion, and sensible defaults for everything you don't specify."],"Static Website Generation":["Ace is highly flexible static pages generator with template inheritance.","Awestruct is a framework for creating static HTML sites.","A static site generator that uses the best toolset available","A Rack application for serving static sites with ERB templates.","Deplot intends to simplify the process of creating and maintaining a staticweb site and allows for modifications of every part of the building process.","DynamicMatic is a tiny Sinatra extension that integrates Sinatra with StaticMatic. It allows most of your site to be static while having a few dynamic pages that can use the StaticMatic layouts and partials.","Rapidly develop static sites using any supported templating language","Fire in the disco. Fire in the ... taco bell.","Jekyll is a simple, blog aware, static site generator.","A static site generator for bloggers with multiple author support","Why another static site generator? Machined is for the developers who know and love the asset pipeline of Rails 3.1 and want to develop blazingly fast static websites. It's built from the ground up using Sprockets 2.0.","A static site generator. Provides dozens of templating languages (Haml, Sass, Compass, Slim, CoffeeScript, and more). Makes minification, compression, cache busting, Yaml data (and more) an easy part of your development cycle.","nanoc is a simple but very flexible static site generator written in Ruby. It operates on local files, and therefore does not run on the server. nanoc “compiles” the local source files into HTML (usually), by evaluating eRuby, Markdown, etc.","Ruhoh is a Universal API for your static blog.","Stasis is a dynamic framework for static sites.","Lightweight Static Site Framework","*Webby* is a fantastic little website management system. It would be called a *content management system* if it were a bigger kid. But, it's just a runt with a special knack for transforming text. And that's really all it does - manages the legwork of turning text into something else, an *ASCII Alchemist* if you will. Webby works by combining the contents of a *page* with a *layout* to produce HTML. The layout contains everything common to all the pages - HTML headers, navigation menu, footer, etc. - and the page contains just the information for that page. You can use your favorite markup language to write your pages; Webby supports quite a few. Install Webby and try it out!","webgen is used to generate static websites from templates and content files (which can be written in a markup language). It can generate dynamic content like menus on the fly and comes with many powerful extensions."],"Rails Authorization":["Role-based authorization system for Rails with a nice DSL for access control lists","Aegis is an authorization solution for Ruby on Rails that supports roles and a RESTish, resource-style declaration of permission rules.","Allowy provides CanCan-like way of checking permission but doesn't enforce a tight DSL giving you more control","Authority helps you authorize actions in your Rails app. It's ORM-neutral and has very little fancy syntax; just group your models under one or more Authorizer classes and write plain Ruby methods on them.","Simple permissions that I have used on my last several projects so I figured it was time to abstract and wrap up into something more easily reusable.","Wraps CanCan and RoleModel up to make role based authorisation really easy in Rails 3.x.","Simple authorization solution for Rails which is decoupled from user roles. All permissions are stored in a single location.","Define your permission rules as role- or role group specific permits. Integrates well with multiple Devise user acounts. Includes rules caching. Store permissions in yaml file or key-value store","An integrated Authentication, Authorization and Roles solution for your Rails 3 app with support for multiple ORMs","declarative_authorization is a Rails plugin for maintainable authorization based on readable authorization rules.","Easy role authorization in rails","An DSL to manage your authorizations and groups of access with CanCan without repeating yourself using as many files you want.","Simple object-based role authorization in Rails","Object oriented authorization for Rails applications","A port of Zend_Acl with modifications made to bring the API more inline with Ruby conventions.","A Ruby on Rails plugin that provides fine grained access control to RESTful resources.","Roles solution for active-record-backed Rails 3 applications","Rails authorization plugin","Ever needed to assign roles to a model, say a User, and build conditional behaviour on top of that? Enter RoleModel -- roles have never been easier! Just declare your roles and you are done. Assigned roles will be stored as a bitmask.","Simple role based security for restful_authentication\n\nI am no longer involved in this project. If you are interested in becoming the new maintainer and making it your own, please contact me. I will no longer be responding to bug reports or questions.\n\nThanks,\n\nTim","Very simple Roles library without any authorization enforcement supporting scope on resource objects (instance or class). Supports ActiveRecord and Mongoid ORMs.","Very simple authorization gem","Authorization for Rails 4 with Web Interface","Trust is a resource oriented framework for authorization control. It has a loose coupling from the models, and features a native Ruby implementation language. Support for inheritance and namespaced models as well as nested routes. Even permissions scheme supports inheritance.","Walruz provides an easy to use DSL to do composition of basic authorization policies to create more complex ones, and then register this composed policies on actions performed to the model begin accessed"],"E-Mail Sending":["Email on Rails. Compose, deliver, receive, and test emails using the familiar controller/view pattern. First-class support for multipart email and attachments.","Capistrano Deployment Email Notification. Keep the whole team informed of each release!","A really Ruby Mail handler.","The simple way to create mails","Send email in one command: Pony.mail(:to =\u003E 'someone@example.com', :body =\u003E 'hello')","Gem to extend ActionMailer with SendGrid API support","TMail is a Ruby-based mail handler. It allows you to compose stadards compliant emails in a very Ruby-way."],"Rails Presenters":["Missing link between models and views. Use presenter pattern in Rails application without changing controllers.","A simple and Rubyish view helper for Rails 3","ActivePresenter is the presenter library you already know! (...if you know ActiveRecord)","Web component framework for Rails providing widgets that trigger events and know when and how to update themselves with AJAX.","Cells are view components for Rails. They are lightweight controllers, can be rendered in views and thus provide an elegant and fast way for encapsulation and component-orientation.","A simple Presenter Pattern for Rails Applications","Easy to understand decorator.","Presenters are easier with delegators, and other friends","An implementation of the Exhibit pattern, as described in Objects on Rails","Draper adds an object-oriented layer of presentation logic to your Rails apps.","Provides an easy to use and transparent system for implementing the Decorator Pattern","Presenters for Rails applications","Uber simple presenters","The missing R to the Rails MVC","Presenter plugin for Ruby on Rails"],"Reports \u0026 Spreadsheets":["This gem uses axlsx to provide excel/xlsx downloads for resources in Active Admin. Often, users are happier with excel, so why not give it to them instead of CSV?","acts_as_xlsx lets you turn any ActiveRecord::Base inheriting class into an excel spreadsheet. It can be added to any finder method or scope chain and can use localized column and sheet names with I18n.","xlsx spreadsheet generation with charts, images, automated column width, customizable styles and full schema validation. Axlsx helps you create beautiful Office Open XML Spreadsheet documents ( Excel, Google Spreadsheets, Numbers, LibreOffice) without having to understand the entire ECMA specification. Check out the README for some examples of how easy it is. Best of all, you can validate your xlsx file before serialization so you know for sure that anything generated is going to load on your client's machine.","Axlsx_Rails provides an Axlsx renderer so you can move all your spreadsheet code from your controller into view files. Partials are supported so you can organize any code into reusable chunks (e.g. cover sheets, common styling, etc.) You can use it with acts_as_xlsx, placing the to_xlsx call in a view and adding ':package =\u003E xlsx_package' to the parameter list. Now you can keep your controllers thin!","Ruby on Rails reporting framework","Easy SQL based report generation with the ability to accept request parameters and render multiple formats.","Dynamic Ruby Reporting Engine with support for Charts.","Allows you to program spreadsheets using .rxls views","This is a library to read/write Google Spreadsheet.","JRuby gem for performing multidimensional queries of relational database data using Mondrian OLAP Java library","a data munging and reporting library for Ruby","Generates ODF files, given a template (.odt) and data, replacing tags","A fast Excel 2007/2010 (.xlsx) file parser that returns a collection of Matrix objects","Open local or remote XLSX, XLS, ODS, CSV (comma separated), TSV (tab separated), other delimited, fixed-width files, and Google Docs. Returns an enumerator of Arrays or Hashes, depending on whether there are headers.","Reportable allows for easy report generation from ActiveRecord models by the addition of the reportable method.","rails gem for easy reporting using google chart api sparklines","Roo can access the contents of various spreadsheet files. It can handle * OpenOffice * Excel * Google spreadsheets * Excelx * LibreOffice * CSV","rubyXL is a gem which allows the parsing, creation, and manipulation of Microsoft Excel (.xlsx/.xlsm) Documents","Ruby Reports is a software library that aims to make the task of reporting less tedious and painful. It provides tools for data acquisition, database interaction, formatting, and parsing/munging.","Work with spreadsheets easily in a native ruby format.","Just as the name says, simple writter for Office 2007+ Excel files","This rubygem does not have a description or summary.","Simple tool for running queries against ActiveRecord and putting them into a Google Spreadsheet.","An ActiveRecord gem that makes it easier to do reporting.","ThinReports is Open Source Reporting Solution for Ruby. It provides a GUI Designer and a Library for Ruby.","Render XLSX from Rails using existing views ( .*.html =\u003E .xlsx )","Workbook contains workbooks, as in a table, contains rows, contains cells, reads/writes excel, ods and csv and tab separated files, and offers basic diffing and sorting capabilities.","WrapExcel is to wrap the win32ole, and easy to use Excel operations with ruby. Detailed description please see the README.","write_xlsx is a gem to create a new file in the Excel 2007+ XLSX format.","xlsx renderer for Rails base on write_xlsx gem"],"Asset Management":["A Railtie that provides an asset management system for css, javascript, and sprites in your Rails applications and engines. ActiveAssets includes two libraries, ActiveExpansions and ActiveSprites. ActiveSprites generates sprites defined by a dsl similar to a route definition. Similarly, ActiveExpansions' dsl creates ActionView::Helpers::AssetTagHelper javascript and stylesheet expansions, and adds additional features","Rails plugin to allow for compressing and bundling JavaScript \u0026 CSS files for production","Load CSS and JS faster. Minifies, bundles, and optimizes CSS/JS assets ahead of time (e.g., on deploy), not at runtime. Loads popular third-party JS (like jQuery, YUI, and Dojo) from localhost in development, and auto-switches to Google's CDN in production. Lets you switch on LABjs mode to load more scripts in parallel. Can rewrite stylesheets to use CDN hosts (not just your web server) and cache-busting hashes for updated images.","Minify for rails js and css","Ruby on Rails plugin - CSS/JS asset bundling in 10 seconds or less!","Gem for splitting up stylesheets that go beyond the IE limit of 4095 selectors, for Rails 3.1+ apps using the Asset Pipeline.","Grunt-based workflow for your Rails assets","Jammit is an industrial strength asset packaging library for Rails, providing both the CSS and JavaScript concatenation and compression that you'd expect, as well as YUI Compressor and Closure Compiler compatibility, ahead-of-time gzipping, built-in JavaScript template support, and optional Data-URI / MHTML image embedding.","Monkey Patches javascript_include_tag...:cache =\u003E... to use jsmin for optimized javascript","Raptest plumbs Rails assets pipeline detecting any issue that may come out during and after their deployment","rucksack is a Rails plug-in to pack and compress CSS- and JavaScript-files with the YUI Compressor. It's easy extendable to use other compressors like Packer, JSMin and CSSTidy.","Smart asset packaging for Rails, Sinatra, and Stasis.","Rails plugin to automatically minify JS and CSS when their bundles get cached. Send in those patches!","Sprocketize provides a command-line utility for the sprockets gem so it can be used without rails."],"User Agent Detection":["Device UserAgent Detector","Parse and process User Agents like a secret one","Do some browser detection with Ruby.","Rack middleware for redirecting unsupported user agents to \"please upgrade\" page","A DSL for writing user agent profiles","Simply determines if a user agent is for a mobile device.","Rack middleware for choosing a version of an interface to render for given request","Adds the mobile format for rendering views for mobile device.","Rack Middleware for filtering by user agent","HTTP User Agent parser","User agent parser","A simple, comprehensive Ruby gem for parsing user agent strings with the help of BrowserScope's UA database"],"Amazon DynamoDB":["Rails ORM for Amazon's DynamoDB.","Dynamoid is an ORM for Amazon's DynamoDB that supports offline development, associations, querying, and everything else you'd expect from an ActiveRecord-style replacement.","DynamoDB ODM in Ruby","local hosted, inmemory fake dynamodb"],"Active Record Enumerations":["Define enum classes in Rails and use them to enumerate ActiveRecord attributes","Extends ActiveRecord attributes with a `:choices` pseudo-type that provides convenient methods for mapping each choice to its human readable form.","A utility that adds class based enum functionality to ActiveRecord attributes","define ActiveRecord constants with DSL.and more!","Easy Attributes is a Ruby DSL to give more control to attributes.","Enable enum type for MySQL db.","Adds support for declaring an ActiveRecord class as an enumeration","Enumerated model attributes and view helpers","Enumerations for Ruby with some magic powers!","Enumerated attributes with I18n and ActiveRecord/Mongoid/MongoMapper support","Enumify lets you add an enum command to ActiveRecord models There are four things that the enumify gems adds to your model Validation - The enumify adds a validation to make sure that the field only receives accepted values Super Cool Methods - adds ? and ! functions for each enum value (canceled? - is it canceled, canceled! - change the state to canceled) Callback support - you can add a x_callback method which will be called each time the status changes Scopes - you can easily query for values of the enum","Power Enum allows you to treat instances of your ActiveRecord models as though they were an enumeration of values. It allows you to cleanly solve many of the problems that the traditional Rails alternatives handle poorly if at all. It is particularly suitable for scenarios where your Rails application is not the only user of the database, such as when it's used for analytics or reporting.","Provides enum-like fields for ActiveRecord, ActiveModel and Mongoid models."],"Data Migration":["Import tabular data from spreadsheets or similar sources into data models","It can create postgresql dump from mysql database or directly load data from mysql to postgresql (at about 100 000 records per minute). Translates most data types and indexes.","A simple database agnostic import/export app to transfer data to/from a remote database."],"Rails Menu Builders":["Helpful method when you need to add some logic that figures out if the link (or more often navigation item) is selected based on the current page or other arbitrary condition","Rails Plugin for Managing and Rendering Menus","Adds a helper method for generating a menubar in Rails","Allows you to save menu items in the database. You can create your own renderer.","Use semantic structures to to build beautifully simple navigation structures in Rails","Ramenu is a simple Ruby on Rails plugin for creating and managing navigation menus for a Rails project.","A plugin to make rails menus easier to write","Simply and customizable navigation in the Ruby on Rails 3 application. Predefined bootstrap renderers","Simple navigation menu gem for Ruby on Rails","With the simple-navigation gem installed you can easily create multilevel navigations for your Rails, Sinatra or Padrino applications. The navigation is defined in a single configuration file. It supports automatic as well as explicit highlighting of the currently active navigation through regular expressions.","simple-navigation-bootstrap is a simple-navigation renderer for twitter-bootstrap navigation and dropdowns.","simple_navigation_renderers gem adds renderers for Bootstrap 2 and 3. With these renderers you will be able create any bootstrap navigation elements, such as: submenus, dividers, headers. As well as add icons to menu elements, such as: gliphicons, font-awesome icons, even custom icons. Also you have split option for main menu containing submenu.","Plug-in to manage tabbed interfaces with ease in Ruby on Rails (or really any menu navigation)","Rails Plugin to generate tabs","TabsOnRails is a simple Rails plugin for creating tabs and navigation menus.","Tabulous provides an easy way to add tabs to your Rails application.","Helpers for generating navigation bars"],"Payments":["Active Merchant is a simple payment abstraction library used in and sponsored by Shopify. It is written by Tobias Luetke, Cody Fauser, and contributors. The aim of the project is to feel natural to Ruby users and to abstract as many parts as possible away from the user to offer a consistent interface across all supported gateways.","Package to simplify including the Adyen payments services into a Ruby on Rails application. The package provides functionality to create payment forms, handling and storing notifications sent by Adyen and consuming the SOAP services provided by Adyen. Moreover, it contains helper methods, mocks and matchers to simpify writing tests/specs for your code.","A straight-forward REST API for Amazon's Flexible Payments Services.","Ruby library for integrating with the Braintree Gateway","Datatrans Integration for Ruby on Rails","Ruby client library for the GMO Payment Platform.","Ruby library for integrating with the MundiPagg payment web services","Ruby gem for interfacing with Pagseguro V2 API.","Lightweight wrapper for Paypal's Adaptive Payments API","Rails javascript plugin for calculating PayPal fees","PayPal Express Checkout API Client for Instance, Recurring and Digital Goods Payment.","The PayPal Invoice SDK provides Ruby APIs to create and manage Invoices using the PayPal's Invoicing Service API.","A Ruby gem wrapper for the pin-payments (pin.net.au) API","An API for using the Amazon Flexible Payment Service (FPS).","Implemention of pain.001.002.03 and pain.008.002.02 (ISO 20022)","Stripe is the easiest way to accept payments online. See https://stripe.com for details.","Stripe webhook integration for Rails applications."],"Security Tools":["Adds methods to set and authenticate against one time passwords. Inspired in AM::SecurePassword\"","A rack middleware for whitelisting and blacklisting IPs","Checks Ruby on Rails models for use of the attr_accessible white list.","Brakeman detects security vulnerabilities in Ruby on Rails applications via static analysis.","dawn is a security static source code analyzer for web applications written in ruby. It supports major MVC frameworks like sinatra, padrino and ruby on rails. dawn output is a list of security vulnerabilities affecting your code. It provides more than 140 security checks with their own mitigation suggestion.","Ruby on Rails Plugin that automatically wraps html_escape() around ActiveRecord attribute methods associated with string and text fields in the database.","Find likely mass assignment vulnerabilities","JSON Web Token and its family (JSON Web Signature, JSON Web Encryption and JSON Web Key) in Ruby","Loofah is a general library for manipulating and transforming HTML/XML documents and fragments. It's built on top of Nokogiri and libxml2, so it's fast and has a nice API. Loofah excels at HTML sanitization (XSS prevention). It includes some nice HTML sanitizers, which are based on HTML5lib's whitelist, so it most likely won't make your codes less secure. (These statements have not been evaluated by Netexperts.) ActiveRecord extensions for sanitization are available in the `loofah-activerecord` gem (see http://github.com/flavorjones/loofah-activerecord).","Provides two class methods on ActiveController::Base that filter the params hash for that controller's actions. You can think of them as the controller analog of attr_protected and attr_accessible.","This plugin replaces the default ERB template handlers with erubis, and switches the behaviour to escape by default rather than requiring you to escape. This is consistent with the behaviour in Rails 3.0.","Shell execution made easy and secure","Adds 'sudo' methods to update protected ActiveRecord attributes with mass assignment","Tarantula is a big fuzzy spider. It crawls your Rails 2.3 and 3.x applications, fuzzing data to see what breaks.","xss_terminate is a plugin in that makes stripping and sanitizing HTML stupid-simple. Install and forget. And forget about forgetting to h() your output, because you won‘t need to anymore."],"API Builders":["Making it easy to serialize models for client-side use","acts_as_api enriches the models and controllers of your app in a rails-like way so you can easily determine how your XML/JSON API responses should look like.","Convert your existing class into an EM-based API.","api-versions helps manage your Rails app API endpoints.","Provides a simple and intuitive templating DSL for serializing objects to JSON.","A Ruby framework for rapid API development with great conventions.","Create JSON structures via a Builder-style DSL","General ruby templating with json, bson, xml and msgpack support","Rocket Pants adds JSON API love to Rails and ActionController, making it simpler to build API-oriented controllers.","roy is a small library which allows every Ruby object to be used as a Rack application.","Render versioned views automagically based on the clients requested version.","A plugin for versioning Rails based RESTful APIs.","Windsor is a plugin for building RESTful APIs in Rails.","Extends the Ruby standard library XMLRPC::BasicServer, providing the Rack compatible XMLRPC::RackServer."],"Object-relational mapping":["Databases on Rails. Build a persistent domain model by mapping database tables to Ruby classes. Strong conventions for associations, validations, aggregations, migrations, and testing come baked-in.","DataMapper core library","Object Graph (Og) is a state of the art ORM system. Og serializes standard Ruby objects to Mysql, Postgres, Sqlite, KirbyBase, Filesystem and more.","Provides a single point of entry for using basic features of ruby ORMs","The Database Toolkit for Ruby","Squeel unlocks the power of Arel in your Rails 3 application with a handy block-based syntax. You can write subqueries, access named functions provided by your RDBMS, and more, all without writing SQL strings."],"Multitenancy":["A new way to manage multi-tenant applications based on multiples databases","Allows a Rails application to run multiple subdomain sites transparently inside of a single Rails instance. This allows for multi-homed or multi-tenant databases very easily.","Integrates multi-tenancy into a Rails application in a convenient and out-of-your way manner","Apartment allows Rack applications to deal with database multitenancy through ActiveRecord","Multi-tenanting gem for hosted Rails/Ruby/devise applications","never let an unscoped Model.all accidentally leak data to an unintended audience.","Integrates multi-tenancy into Rail application with MySql db","Rails multitenancy with PostgreSQL schemas.","This gem helps you providing whitelabel functionality in your application"],"Active Record Default Values":["Allows you to easily specify default values for attributes on new model objects.","The default_value_for plugin allows one to define default values for ActiveRecord models in a declarative manner"],"Active Record DB Adapters":["AR-JDBC is a database adapter for Rails' ActiveRecord component designed to be used with JRuby built upon Java's JDBC API for database access. Provides (ActiveRecord) built-in adapters: MySQL, PostgreSQL and SQLite3 as well as adapters for popular databases such as Oracle, SQLServer, DB2, FireBird and even Java (embed) databases: Derby, HSQLDB and H2. It allows to connect to virtually any JDBC-compliant database with your JRuby on Rails application.","Derby JDBC adapter for JRuby on Rails.","MySQL JDBC adapter for JRuby on Rails.","Postgres JDBC adapter for JRuby on Rails.","ActiveRecord SQL Server Adapter. For SQL Server 2005 And Higher.","A database backend that translates database interactions into no-ops. Using NullDB enables you to test your model business logic - including after_save hooks - without ever touching a real database.","Oracle \"enhanced\" ActiveRecord adapter contains useful additional methods for working with new and legacy Oracle databases. This adapter is superset of original ActiveRecord Oracle adapter.","This gem includes several enhancements and customizations to the standard ActiveRecord Oracle Enhanced adapter, which is still required. Any customizations to this adapter's behaviour or additional Oracle-specific utilities should be added here."],"Geocoding \u0026 Maps":["This is an ActiveRecord connection adapter for PostGIS. It is based on the stock PostgreSQL adapter, but provides built-in support for the spatial extensions provided by PostGIS. It uses the RGeo library to represent spatial data in Ruby.","Simple geocoding for Rails ActiveRecord models. See the README for more details.","A tiny Ruby library to quickly standardize a postal address","Beautiful map generation","GDAL/OGR bindings for ruby","A helper library for the ruby bindings to gdal (http://gdal.org)","Provides object geocoding (by street or IP address), reverse geocoding (coordinates to street address), distance queries for ActiveRecord and Mongoid, result caching, and more. Designed for Rails but works with Sinatra and other Rack frameworks too.","A wrapper to MaxMind's GeoIP services, that can work with both free and paid versions. Also provides geo-location methods to Active Record and Sequel Models. This product includes GeoLite data created by MaxMind, available from http://www.maxmind.com/.","Geokit provides geocoding and distance calculation in an easy-to-use API","Official Geokit plugin for Rails/ActiveRecord. Provides location-based goodness for your Rails app. Requires the Geokit gem.","Zero-effort creation of Location-aware Rails application based on W3C Geolocaton API.","GeoRuby provides geometric data types from the OGC 'Simple Features' specification.","GeoRuby is intended as a holder for data returned from PostGIS and MySQL Spatial queries. The data model roughly follows the OGC \u0026quot;Simple Features for SQL\u0026quot; specification (see www.opengis.org/docs/99-049.pdf), although without any kind of advanced functionalities (such as geometric operators or reprojections)","creates (W)ell(K)nown(T)ext bounding boxes from points","Use together GeoRuby, Rgeo, Geokit, Proj4j (and others)","GeoRuby provides geometric data types from the OGC 'Simple Features' specification.","Enables easy Google map + overlays creation.","Graticule is a geocoding API that provides a common interface to all the popular services, including Google, Yahoo, Geocoder.us, and MetaCarta.","This gem provides the leaflet.js map display library for your Rails 3/4 application.","library dedicated to generate OSM javascript","Mongoid Extension that simplifies MongoDB casting and operations on spatial Ruby objects.","GeoRuby provides geometric data types from the OGC 'Simple Features' specification.","Execute PostGIS functions on Active Record","GeoRuby provides geometric data types from the OGC 'Simple Features' specification.","Pretty wrapper for GDAL/OGR","RGeo is a geospatial data library for Ruby. It provides an implementation of the Open Geospatial Consortium's Simple Features Specification, used by most standard spatial/geographic data storage systems such as PostGIS. A number of add-on modules are also available to help with writing location-based applications using Ruby-based frameworks such as Ruby On Rails.","A port of the YM4R-GM plugin for rails, to github"],"Reputation Engines":["ActiveRecord Reputation System gem allows rails apps to compute and publish reputation scores for active record models.","Add \"badges\" to any Rails model.","Adds common gamification features such as points, leaderboards, and achievements to a Rails Application.","Manage badges, points and rankings (reputation) of resources in a Rails application.","Recognize users by giving them points and rewards for their actions","reputation is designed to help calculate reputation scores based on user behaviour and rules that are easily editable."],"I18n":["translatable activerecord attributes","Ruby translation client","Client for the Copycopter copy management service","Delocalize is a tool for parsing localized dates/times and numbers.","A simple, fast, memory-efficient and threadsafe implementation of GetText","Rails I18n de-facto standard library for ActiveRecord model/data translation.","Rails I18n: de-facto standard library for ActiveRecord data translation","Rails I18n de-facto standard library for ActiveRecord 3 model/data translation.","Create translations for your ActiveRecord models. Uses delegate pattern. Fully tested and used in a several production sites.","Find out which locale the user preferes by reading the languages they specified in their browser","Translate model attribute values from locales","The internationalizer. Replaces plain text strings in your views and replaces them with I18n message strings so you only have to provide the translations.","New wave Internationalization support for Ruby.","I18nAutoScoping is a plugin for Ruby on Rails that lets you easily add auto-scope in your I18n translation. It is very useful if you do not want to add every time the scope in your views ! Especially if your are working on big projects !","Database Backend for Rails I18n","Plug-in that provides I18n Inflector module integration with Rails.","It's a small library to provide the Rails I18n translations on the Javascript.","I18n_routing is a plugin for Ruby on Rails that lets you easily translate your routes trough the I18n api included in Rails since version 2.2","i18n-tasks finds and manages missing and unused translations in your application. It scans calls such as `I18n.t('some.key')` and provides reports on key usage, missing, and unused keys. It can also can pre-fill missing keys, including from Google Translate, and it can remove unused keys as well.","Synchronizes i18n translation keys and content with localeapp.com so you don't have to manage translations by hand.","Parses HTTP_ACCEPT_LANGUAGE http header and sets the I18n.locale based on that, if it's missing it uses toplevel regional domain suffix or falls back to I18n.default_locale","Minimal implementation of Globalize2 style model translations. Rails 2.2 is required.","MongoDB backend implementation for I18n gem.","Translate mongoid models.","Convert numbers to words using I18N.","phrase allows you to edit translations in-place on the page itself. More information at phraseapp.com","Anslatetray ouryay Ailsray appway otay Igpay Atinlay!! (Translate your Rails app to Pig Latin!) Includes a rake task to translate all of your i18n locale configurations to pig latin. Or, generate pig latin on the fly!","Pure model translations","I18n tool to translate your Ruby application.","rack-i18n_routes is a Rack middleware component that internally re-routes URLS that have been translated into untranslated or canonical URL.","Rack Based Locale Selector","A Rack module for getting and setting a user's locale via a cookie or browser default language.","A rails engine adding an interface for translating and writing translation files. Works with rails 3 and 4.","Sets the current locale of a request using a combination of params, cookies, and http headers","Simple gem to translate multi-lingual content in Rails models in separate tables for each model (modelname_translations)","ready_for_i18n will help you extract visible hard-coded text from your ERB view files, then choose a proper key and replace them with the I18n.translate method like t(:login)","Add a pirate translation layer to your Rails app! Talk, like a Pirate!","Adds language translation methods to strings and arrays, backed by the Google Translate API","Crowd-sourced translation and localization engine for Rails.","Simple tool to ease synchronization of locale files","Rails plugin to translate your URLs and routing helpers on an clean way."],"Active Record Sharding":["AcviveRecord Sharding plugin","Sharding and replication support for ActiveRecord","DbCharmer is a Rails plugin (and gem) that could be used to manage AR model connections, implement master/slave query schemes, sharding and other magic features many high-scale applications need.","ActiveRecord connection proxy for master/slave connections","Connection proxy for ActiveRecord for single master / multiple slave database deployments","This gem allows you to use sharded databases with ActiveRecord. This also provides a interface for replication and for running migrations with multiples shards.","Horizontal scaling for your Rails or Merb app.  Built on ActiveRecord."],"HTTP clients":["This gem adds possibility to access http response object from result of ActiveResource::Base find method","Api client easy to play with parallelism support!","APISmith provides tools to make working with structured HTTP-based apis even easier.","Curb (probably CUrl-RuBy or something) provides Ruby-language bindings for the libcurl(3), a fully-featured client-side URL transfer library. cURL and libcurl live at http://curl.haxx.se/","EventMachine based, async HTTP Request client","EXtended http(s) CONnections","HTTP/REST API client library.","An opinionated Ruby-based Hypermedia API client.","This simple library implements HTCP protocol (www.htcp.org/) and could be used in any Ruby project to manage any HTCP-compliant caching server (authors use it for Squid 2.7 servers management).","Makes http fun! Also, makes consuming restful web services dead easy.","gives something like the functionality of libwww-perl (LWP) in Ruby","Common interface for Ruby's HTTP libraries","A Wrapper around Net/HTTP which allows you to perform HTTP Requests. Gives you a simple API interface to send multipart requests. You can also send HTTP calls using the verbs OPTIONS, PATCH, MOVE, HEAD, TRACE","HyperClient is a Ruby Hypermedia API client.","The Mechanize library is used for automating interaction with websites. Mechanize automatically stores and sends cookies, follows redirects, and can follow links and submit forms. Form fields can be populated and submitted. Mechanize also keeps track of the sites that you have visited as a history.","Use with Net::HTTP to do multipart form posts. IO values that have #content_type, #original_filename, and #local_path will be posted as a binary file.","Simple Ruby HTTP/REST client with a sane API","Ruby HTTP client library based on libcurl","Persistent HTTP connections for HTTParty using the persistent_http gem. Keep the party alive!","Evolve your API","Remote API based model associations.","A simple HTTP and REST client for Ruby, inspired by the Sinatra microframework style of specifying actions: get, put, post, delete.","restfulie","A streaming REST client for Ruby, in C.","Like a modern code version of the mythical beast with 100 serpent heads, Typhoeus runs HTTP requests in parallel while cleanly encapsulating handling logic.","A framework and DSL to construct Ruby clients to RESTful web services.","Wrest is a fluent, easy-to-use, object oriented Ruby HTTP/REST client library with support for RFC2616 HTTP caching, multiple HTTP backends and async calls using EventMachine. It runs on CRuby, JRuby and Rubinius."],"Ruby Core Extensions":["A toolkit of support libraries and Ruby core extensions extracted from the Rails framework. Rich support for multibyte strings, internationalization, time zones, and testing.","DeepTree simplifies fetching deeply nested nodes in Ruby hashes.","Docile turns any Ruby object into a DSL. Especially useful with the Builder pattern.","Support library for Merb","Facets is the premier collection of extension methods for the Ruby programming language. Facets extensions are unique by virtue of thier atomicity. They are stored in individual files allowing for highly granular control of requirements. In addition, Facets includes a few additional classes and mixins suitable to wide variety of applications.","Efficient, Immutable, Thread-Safe Collection classes for Ruby","Hashie is a small collection of tools that make hashes more powerful. Currently includes Mash (Mocking Hash) and Dash (Discrete Hash).","A Ruby gem implementing additional proposed methods for the Hash class: #map_pair, #map_key, #map_value","This gem simulates named-parameters in Ruby. It's a complement to the common Ruby idiom of using Hash args to emulate the use of named parameters.","Revenge of the Hash options. Hash will beat `keyword arguments`!!","PluginFactory is a mixin module that turns an including class into a factory for its derivatives, capable of searching for and loading them by name. This is useful when you have an abstract base class which defines an interface and basic functionality for a part of a larger system, and a collection of subclasses which implement the interface for different underlying functionality. An example of where this might be useful is in a program which talks to a database. To avoid coupling it to a specific database, you use a Driver class which encapsulates your program's interaction with the database behind a useful interface. Now you can create a concrete implementation of the Driver class for each kind of database you wish to talk to. If you make the base Driver class a PluginFactory, too, you can add new drivers simply by dropping them in a directory and using the Driver's `create` method to instantiate them:","A few useful extensions to core Ruby classes.","RubyTree is a pure Ruby implementation of the generic tree data structure. It provides a node-based model to store named nodes in the tree, and provides simple APIs to access, modify and traverse the structure. The implementation is node-centric, where individual nodes in the tree are the primary structural elements. All common tree-traversal methods (pre-order, post-order, and breadth-first) are supported. The library mixes in the Enumerable and Comparable modules to allow access to the tree as a standard collection (iteration, comparison, etc.). A Binary tree is also provided, which provides the in-order traversal in addition to the other methods. RubyTree supports importing from, and exporting to JSON, and also supports the Ruby's standard object marshaling. This is a BSD licensed open source project, and is hosted at http://github.com/evolve75/RubyTree, and is available as a standard gem from http://rubygems.org/gems/rubytree. The home page for RubyTree is at http://rubytree.rubyforge.org.","Recursively traverses data structures (Hash \u0026 Array currently)","A Scala-inspired Monad library for Ruby, aiming to share the most common idioms for folks working in both languages. Includes Option, Array, etc.","a lightweight core and extra extensions for Ruby.","Sweetens your Ruby code with syntactic sugar, which you do not want to miss again."],"Active Record Versioning":["Generic approval queues for record creation and updates","acts_as_revisable enables revision tracking, querying, reverting and branching of ActiveRecord models. Inspired by acts_as_versioned.","ActiveRecord extension that provides revision support so that history can be tracked and changes can be reverted. Emphasis for this plugin versus similar ones is including associations, saving on storage, and extensibility of the model.","Add simple versioning to ActiveRecord models.","A simple gem that audit ActiveRecord models' attributes or methods by taking snapshots and diff them for you. Starting from scratch to work with Rails 3.2.2 onwards","Log all changes to your models","A simple, yet flexible solution to tracking changes made to objects in your database.","Allows for your ActiveRecord models to have drafts which are stored in a separate duplicate table.","Rewrite of the original historical-plugin using MongoDB","Track changes to your models' data. Good for auditing or versioning.","ActiveRecord versioning","A zero-configuration RESTful ActiveRecord server.","Provides a straightforward way for auditing changes on active record models, especially for composite entities. Also provides helper methods for easily rendering an audit trail in Ruby on Rails views.","SimplyVersioned is a simple, non-invasive, approach to versioning ActiveRecord models.","version_fu helps version your ActiveRecord models. It is based on Rick Olson's acts_as_versioned and is compatible with Rails 3.","Keep a DRY history of your ActiveRecord models' changes"],"Active Record Soft Delete":["An ActiveRecord plugin for atomic archiving and unarchiving of object trees. Inspired by ActsAsParanoid and PermanentRecord","Don't delete your records, move them to a different table. Like acts_as_paranoid, but doesn't mess with your SQL queries.","Active Record (~\u003E3.2) plugin which allows you to hide and restore records without actually deleting them. Check its GitHub page for more in-depth information.","Rails plugin that provides the ability to soft delete models","Safe destroy for ActiveRecord.","Typical paranoid gem built for Rails 3 and with the minimum code needed to satisfy acts_as_paranoid's API","Paranoia is a re-implementation of acts_as_paranoid for Rails 3, using much, much, much less code. You would use either plugin / gem if you wished that when you called destroy on an Active Record object that it didn't actually destroy it, but just \"hid\" the record. Paranoia does this by setting a deleted_at field to the current time when you destroy a record, and hides it by scoping all queries on your model to only include records which do not have a deleted_at field.","Enable soft delete of ActiveRecord records. Based off defunct ActsAsParanoid and IsParanoid","paranoid models for rails 4","Never Lose Data. Rather than deleting rows this sets Record#deleted_at and gives you all the scopes you need to work with your data.","Active Record (~\u003E3.2) plugin which allows you to hide and restore records without actually deleting them. Check its GitHub page for more in-depth information.","Explicit soft deletion for ActiveRecord via deleted_at and default scope."],"Active Record User Stamping":["ActiveRecord extension that logs all changes to your models in an audits table","Simple log utility for models. Add any number of optional arbitrary details fields, or user_id.","Handles ActiveRecord authors in the same way as timstamps.","Rails: Record user activities without controller helpers, build on top of userstamps plugin","","This Rails plugin extends ActiveRecord::Base to add automatic updating of created_by and updated_by attributes of your models in much the same way that the ActiveRecord::Timestamp module updates created_(at/on) and updated_(at/on) attributes.","A Rails plugin that adds the ability to automatically stamp each record with the currently logged in user."],"Rails Comments":["Plugin/gem that provides comment functionality","Similar to acts_as_commentable; however, utilizes awesome_nested_set to provide threaded comments","Allows comments to be easily added to different models.","A Rails engine for comments.","Integrates Disqus into your Ruby-powered site. Works with any Ruby website, and has view helpers for Rails and Merb.","Rails: Make an ActiveRecord resource ratable/reviewable (rate + text), without the usual extra code-smell.","A commenting server similar to Disqus and IntenseDebate","Opinio is an engine used to add comments functionallity to rails 3 applications."],"Configuration Management":["Storage of configuration values in database","Reads YAML files with configuration. Allows you to specify default configuration file you can store in repository and overwrite it with custom configuration file for each application instance and environment.","Move the config out of your app, and into App.","An easy to use, framework agnostic, customizable library to easily store and retrieve application configuration.","A simple system for configuring Ruby applications.","A powerful Ruby configuration system.","does your gem or project require configuration? This will make creating and parsing configuration a snap!","You've got a script. It's got some settings. Some settings are for this module, some are for that module. Most of them don't change. Except on your laptop, where the paths are different. Or when you're in production mode. Or when you're testing from the command line. \"\" So, Consigliere of mine, I think you should tell your Don what everyone knows. \"\" -- Don Corleone Configliere manage settings from many sources: static constants, simple config files, environment variables, commandline options, straight ruby. You don't have to predefine anything, but you can ask configliere to type-convert, require, document or password-obscure any of its fields. Modules can define config settings independently of each other and the main program.","If you need to create a custom config file for you project, ConfigLoader will help you to load the contents of this file.","Provides convenient tool for storing configuration","Library authors can now easily add class-level configuration including YAML loading with just a few lines of code.","Are you tired of writing custom code to parse and represent every new configuration file utilized in your programs? The Config Toolkit generates configuration classes and can populate them robustly by parsing different formats of configuration files.","Auto-create configuration objects for your applications from yml and json files.","Configurability is a unified, unintrusive, assume-nothing configuration system for Ruby. It lets you keep the configuration for multiple objects in a single config file, load the file when it's convenient for you, and distribute the configuration when you're ready, sending it everywhere it needs to go with a single action.","Configurable is a Rails 3 engine that allows you to set up config variables in a config file, specifying default values for all environmentspec. These variables can then be set on a per-app basis using a user facing configuration screen.","ruby configuration for your ruby programs","Configus helps you easily manage environment specific settings","A simple, hash/struct-based configuration object","Supports defaults, over-rides, and environments","Manage your configuration via the dot syntax.","Loads environment variables from `.env`.","Autoload dotenv in Rails.","Flexible configuration library for Ruby and Rails applications.","Simple, Heroku-friendly Rails app configuration using ENV and a single YAML file","Dead simple Ruby config store.","Simple way to load your configs from yaml","This gem is to provide a simple way of storing information in one place and get this information anywhere in a Rails application.","Settings gem for Ruby on Rails","Silent killer of dependencies and configs","a configuration library for Ruby","Easy to use Settings helper that loads its data in from config/settings.yml. Handles adding multiple sources, and easy reloading.","Settings is a plugin that makes managing a table of global key, value pairs easy.","Configuration management library for Ruby applications.","A simple and straightforward settings solution that uses an ERB enabled YAML file and a singleton design pattern.","SimpleConfig is a plugin designed to make application-wide configuration settings (e.g. in a Rails app) easy to set and access in an object-oriented fashion.","Grown up ActiveRecord::Store config options!","The library creates, saves, and loads configuration files, which are in a user's home directory or a specified directory.","Create settings/contants for your Rails 3 app using yml key/value pairs"],"Active Record Nesting":["Adds directed acyclic graph functionality to ActiveRecord.","NOTICE: official repository moved to https://github.com/bbommarito/acts_as_nested_set","ActiveRecord extension for sorted adjacency lists support","A gem that adds simple support for organizing ActiveRecord models into parent–children relationships.","Organise ActiveRecord model into a tree structure","Arboreal is yet another extension to ActiveRecord to support tree-shaped data structures. Internally, Arboreal maintains a computed \"ancestry_string\" column, which caches the path from the root of a tree to each node, allowing efficient retrieval of both ancestors and descendants. Arboreal surfaces relationships within the tree like \"children\", \"ancestors\", \"descendants\", and \"siblings\" as scopes, so that additional filtering/pagination can be performed.","An awesome nested set implementation for Active Record","better_nested_set Rails plugin (my fork from official SVN)","Easily and efficiently make your ActiveRecord model support hierarchies"],"Background Jobs":["Seamlessly integrates Java's Executor framework with Ruby on Rails","Widely used, feature-rich asynchronous RabbitMQ client with batteries included.","Beanstalk background job processing made easy","Execute any ActiveRecord Model method in the background","Running Long Background Tasks In Ruby On Rails Made Dead Simple","A Ruby/Rails job server and scheduler","Beanstalk is a simple, fast work queue.","A highly available, reliable messaging infrastructure","bj","Easy to use, feature complete Ruby client for RabbitMQ 2.0 and later versions.","The crowd, suddenly there where there was nothing before, is a mysterious and universal phenomenon. A few people may have been standing together -- five, ten or twelve, nor more; nothing has been announced, nothing is expected. Suddenly everywhere is black with people and more come streaming from all sides as though streets had only one direction.","Modern concurrency tools including agents, futures, promises, thread pools, actors, supervisors, and more. Inspired by Erlang, Clojure, Go, JavaScript, actors, and classic concurrency patterns.","Delayed_job (or DJ) encapsulates the common pattern of asynchronously executing longer tasks in the background. It is a direct extraction from Shopify where the job table is responsible for a multitude of core tasks.","RabbitMQ JRuby based workers on top of hot_bunnies","Background processing, simplified","Simple Asynchronous Processing","JobReactor is a library for creating, scheduling and processing background jobs. It is asynchronous client-server distributed system based on EventMachine.","Lean Redis-backed event scheduling library for Ruby","Gem for lazy caching","Simple background job processor inspired by delayed_job, but aiming for database agnosticism.","a Ruby library for queuing and processing background jobs with configurable backends.","A worker queue framework built around beanstalkd","queue_classic is a queueing library for Ruby apps. (Rails, Sinatra, Etc...) queue_classic features asynchronous job polling, database maintained locks and no ridiculous dependencies. As a matter of fact, queue_classic only requires pg.","Background jobs on RabbitMQ","Resque is a Redis-backed Ruby library for creating background jobs, placing those jobs on multiple queues, and processing them later. Background jobs can be any Ruby class or module that responds to perform. Your existing classes can easily be converted to background jobs or you can create new classes specifically to do work. Or, you can do both. Resque is heavily inspired by DelayedJob (which rocks) and is comprised of three parts: * A Ruby library for creating, querying, and processing jobs * A Rake task for starting a worker which processes jobs * A Sinatra app for monitoring queues, jobs, and workers.","Resque-mongo is a fork of resque that uses mongo as a queue backend. Resque is a Redis-backed Ruby library for creating background jobs, placing those jobs on multiple queues, and processing them later. Background jobs can be any Ruby class or module that responds to perform. Your existing classes can easily be converted to background jobs or you can create new classes specifically to do work. Or, you can do both. Resque is heavily inspired by DelayedJob (which rocks) and is comprised of three parts: * A Ruby library for creating, querying, and processing jobs * A Rake task for starting a worker which processes jobs * A Sinatra app for monitoring queues, jobs, and workers.","A unified interface for various messaging queues","Run commands","Simple, efficient background processing for Ruby","A Ruby library implementing a Simple Message Queue protocol","A job queueing and background workers system using Beanstalkd. Inspired by the Minion gem.","Starling is a light-weight, persistent queue server that speaks the memcached protocol. It was originally developed for Twitter's backend.","Asynchronous processing library for Ruby","Fast and easy task runner for Rails. Got work?","easily do background work in rails, without commiting to a particular runner. comes with starling, bj and spawn runners."],"Rails Search":["Rails plugin that adds powerful full text search capabilities to ActiveRecord models.","Creates an auxiliary table in order to be used with full-text searches","Acts As Indexed is a plugin which provides a pain-free way to add fulltext search to your Ruby on Rails app","Acts As Solr","This gem adds full text search capabilities and many other nifty features from Apache Solr to any Rails model.","Ruby wrapper for Lucene Solr","Elastictastic is an object-document mapper and lightweight API adapter for ElasticSearch. Elastictastic's primary use case is to define model classes which use ElasticSearch as a primary document-oriented data store, and to expose ElasticSearch's search functionality to query for those models.","Ferret is a super fast, highly configurable search library.","PgSearch builds Active Record named scopes that take advantage of PostgreSQL's full text search","High performance real-time search (Support Chinese), index in Redis for Rails application.","RSolr aims to provide a simple and extensible library for working with Solr","It will search on the attributes that you provided to simple_search_attributes method","Scoped search makes it easy to search your ActiveRecord-based models. It will create a named scope :search_for that can be called with a query string. It will build an SQL query using the provided query string and a definition that specifies on what fields to search. Because the functionality is built on named_scope, the result of the search_for call can be used like any other named_scope, so it can be chained with another scope or combined with will_paginate. Because it uses standard SQL, it does not require any setup, indexers or daemons. This makes scoped_search suitable to quickly add basic search functionality to your application with little hassle. On the other hand, it may not be the best choice if it is going to be used on very large datasets or by a large user base.","Search made easy","Searchlight helps you build searches from options via Ruby methods that you write. Searchlight can work with any ORM or object that allows chaining search methods. It comes with modules for integrating with ActiveRecord and ActionView, but can easily be used in any Ruby program.","This gem has been renamed to \"tire\", please go to https://rubygems.org/gems/tire","Build SOLR queries, properly escaped, with a nice API","Sunspot is a library providing a powerful, all-ruby API for the Solr search engine. Sunspot manages the configuration of persistent Ruby classes for search and indexing and exposes Solr's most powerful features through a collection of DSLs. Complex search operations can be performed without hand-writing any boolean queries or building Solr parameters by hand.","Sunspot::Rails is an extension to the Sunspot library for Solr search. Sunspot::Rails adds integration between Sunspot and ActiveRecord, including defining search and indexing related methods on ActiveRecord models themselves, running a Sunspot-compatible Solr instance for development and test environments, and automatically commit Solr index changes at the end of each Rails request.","Sunspot::Solr provides a bundled Solr distribution for use with Sunspot. Typical deployment environments will require more configuration, but this distribution is well suited to development and testing.","Texticle exposes full text search capabilities from PostgreSQL, extending ActiveRecord with scopes making search easy and fun!","An intelligent layer for ActiveRecord (via Rails and Sinatra) for the Sphinx full-text search tool.","Tire is a Ruby client for the Elasticsearch search engine/database. It provides Ruby-like API for fluent communication with the Elasticsearch server and blends with ActiveModel class for convenient usage in Rails applications. It allows to delete and create indices, define mapping for them, supports the bulk API, and presents an easy-to-use DSL for constructing your queries. It has full ActiveRecord/ActiveModel compatibility, allowing you to index your models (incrementally upon saving, or in bulk), searching and paginating the results. Please check the documentation at \u003Chttp://karmi.github.com/retire/\u003E.","XapianDb is a ruby gem that combines features of nosql databases and fulltext indexing. It is based on Xapian, an efficient and powerful indexing library","Ruby library for interacting with Xapian. Includes full text search, faceted options, spelling suggestions, and more."],"PDF Generation":["XHTML to PDF using Flying Saucer java library","Provides a simple ruby wrapper around the DocRaptor API","Inline PDF templates that use prawn.","Utility for converting markup files to pdf files. Useful for reports etc.","A framework that generates PDF and e-Pub from Markdown, Textile, and HTML files.","Uses wkhtmltopdf to create PDFs using HTML","Prawn is a fast, tiny, and nimble PDF generator for Ruby","Prawn Handler for RoR 3.x projects handles and registers pdf formats","Support .prawn templates as Prawn::Document content","Simple PDF generation using the prawn library.","A wrapper for the PrinceXML PDF generation library.","Ruby Ghostscript Engine is a document creation and conversion API, support(PDF,PS,GIF,TIF,PNG,JPG...). It uses the GhostScript framework for the format conversion, utilizes EPS templates and is optimized to work with larger documents.","LaTeX preprocessor for PDF generation; Rails plugin","html to pdf with phantomjs","Wicked PDF uses the shell utility wkhtmltopdf to serve a PDF file to a user from HTML. In other words, rather than dealing with a PDF generation DSL of some sort, you simply write an HTML view as you would normally, and let Wicked take care of the hard stuff.","Wisepdf uses the shell utility wkhtmltopdf to serve a PDF file to a user from HTML. In other words, rather than dealing with a PDF generation DSL of some sort, you simply write an HTML view as you would normally, and let pdf take care of the hard stuff.","Provides binaries for WKHTMLTOPDF project in an easily accessible package."],"Social Network Builders":["acts_as_follower is a Rubygem to allow any model to follow any other model. This is accomplished through a double polymorphic relationship on the Follow model. There is also built in support for blocking/un-blocking follow records. Main uses would be for Users to follow other Users or for Users to follow Books, etc… (Basically, to develop the type of follow system that GitHub has)","ActsAsFriendable provides a Friendship model, relevent scopes, and many instance methods to quickly and easily add Social Networking functionality to your Rails application.","Rails plugin for cleanly modeling social networks using ActiveRecord","Relationships (e.g. friendships) backed by Redis","Adds basic social networking capabilities to your existing application, including users, blogs, photos, clippings, favorites, and more.","EngineY is an easy to use social network framework and portal implemented in Ruby on Rails that is easy to customize and deploy as your own powerful social media site or other portal type site. Empower users with their own blogs. Enhance collaboration with forums, groups and events. Let your users post Twitter-like status messages. Track all the activity on your site with a live activity stream. Build a custom client to access all of your social data using EngineY's RESTful API.  Also includes integration with Facebook Connect to allow users to login with Facebook credentials.  Recent additions include support for Themes, and Content Management.  For project updates and information, follow the project on Twitter @engineyfw","Simple Models for managing simple friendship relationships.","A plugin to ease your effort of building profile of user, company, project, pet, group.... blah blah blah","Inkwell provides simple way to add social networking features like comments, reblogs, favorites, following/followers, communities, categories and timelines to your Ruby on Rails application.","An open source social networking platform in Ruby on Rails","Leaderboards backed by Redis in Ruby","Likeable allows you to make your models...well...likeable using redis.","Open Source Social Network written in Ruby on Rail by Less Everything","A generalized Rack middleware for importing contacts from major email providers.","Socialization allows any model to Follow and/or Like any other model. This is accomplished through a double polymorphic relationship on the Follow and Like models. But you don't need to know that since all the complexity is hidden from you.","Social Stream is a Ruby on Rails engine for building social network websites. It supports contacts, posts, file uploads, private messages and much more."],"Redis Clients":["A sortable and searchable list backed by Redis. You can use it as a quick actionable workflow queue which you can search/sort and paginate thorough","Ohm is a library that allows to store an object in Redis, a persistent key-value database. It includes an extensible list of validations and has very good performance.","Small lib which helps with extending your classes or modules with redis (and nest) goodies.","A module that allows Ruby objects to define attributes backed by a Redis data store. Works with any class or ORM.","Map Redis types directly to Ruby objects. Works with any class or ORM.","ORM for Redis (advanced key-value storage) with ActiveRecord API","A Ruby client that tries to match Redis' API one-to-one, while still providing an idiomatic interface. It features thread-safety, client-side sharding, pipelining, and an obsession for performance.","Namespaced Rack::Session, Rack::Cache, I18n and cache Redis stores for Ruby web frameworks."],"Active Record Sortables":["This \"acts_as\" extension provides the capabilities for sorting and reordering a number of objects in a list. The class that has this specified needs to have a \"position\" column defined as an integer on the mapped database table.","Just like acts_as_list, but allows updating through standard restful methods.","ranked-model is a modern row sorting library built for Rails 3 \u0026 4. It uses ARel aggressively and is better optimized than most other libraries.","Positionless model sorting for Rails 3.","Sortable provides a DSL for defining sort order on any Ruby object To use it, you just call the sortable method and pass it a list of methods and/or blocks; when you call sort on a collection of these objects, each method/block is evaluated in turn, and the first that provides a non-zero sort value is used."],"User Messaging Systems":["Make user messageable!;-)","Allows caching of pages with flash messages by rendering flash messages from a cookie using JavaScript, instead of statically in your Rails view template. Flash contents are converted to JSON and placed in a cookie by an after_filter (default) or a Rack Middleware (option).","Messaging engine","Tiny gem which provides growl-styled flash messages for Ruby on Rails with Bootstrap. For XHR requests flash messages are transfering in 'X-Messages' headers, otherwise they are storing in js variables.","Messaging system for Rails 3 app","A Rails engine that allows any model to act as messageable, adding the ability to exchange messages with any other messageable model, even different ones. It supports the use of conversations with two or more recipients to organize the messages. You have a complete use of a mailbox object for each messageable model that manages an inbox, sentbox and trash for conversations. It also supports sending notifications to messageable models, intended to be used as system notifications.","A simple newsletter engine for rails.","Rails Simple User Messaging System, work also with Refinery CMS"],"Rails Permalinks \u0026 Slugs":["acts as param","A library for creating slugs. Babosa an extraction and improvement of the string code from FriendlyId, intended to help developers create similar libraries or plugins.","Configurable, but assumes a conservative strategy by default with a goal to solve many search engine index problems: multiple hostnames, inbound links with arbitrary parameters, trailing slashes.","find_by_param is a nice and easy way to handle permalinks and dealing with searching for to_param values","FriendlyId is the \"Swiss Army bulldozer\" of slugging and permalink plugins for Active Record. It lets you create pretty URLs and work with human-friendly strings as if they were numeric ids.","SEO Permalink Plugin for Ruby on Rails.","has_slug is a plugin that provides slugging capabilities to Ruby on Rails models. Inspired by the friendly_id plugin.","Make your ActiveRecord IDs non-obvious","Automatically convert fields to permalinks","Rails abstraction of word-based slugs for URLs, w/ or w/o leading numeric IDs.","Simple, straightforward slugs for your ActiveRecord models.","Automatically create SEO friendly, unique permalinks for your ActiveRecord objects. Behaves exactly like ActiveRecord#find","Super simple slugs for ActiveRecord 3.0 and higher, with support for slug history","Some [hopefully] useful extensions to Ruby's String class. Stringex is made up of three libraries: ActsAsUrl [permalink solution with better character translation], Unidecoder [Unicode to ASCII transliteration], and StringExtensions [miscellaneous helper methods for the String class].","Rails plugin that adds a to_slug method to String instances. Slugs can be used for URLs, since all 'dangerous' characters have been filtered out."],"Rails Ratings":["Acts_as_rateable is a rails plugin providing a rating interface for ActiveRecord models.","Flexible, configurable, and easy to use with the defaults. Supports 3 different ways to manage rating statistics.","Provides a simple way to add rating functionality to your application.","Provides a simple way to add rating functionality to your application.","Demonstrates a reference implementation for handling ratings in ActiveRecord","Ratings for your model.","Provides the best solution to add rating functionality to your models.","Provides fields and methods for the rating manipulation on Mongoid documents.","Simple rating solution for mongoid"],"Rails Tagging":["With ActsAsTaggableOn, you can tag a single model on several contexts, such as skills, interests, and awards. It also provides other advanced functionality.","Rails plugin that is based on acts_as_taggable by DHH but includes extras such as tests, smarter tag assignment, and tag cloud calculations.","Allows user owned tags for multiple classes, and makes tags easier to work with.","Clortho makes keyword and full-text search a breeze for MongoMapper users.","tagging that doesn't want to be on steroids. it's skinny and happy to stay that way.","Markable allows you to easily create a marking system in your rails application.","A modern fast tagging framework for Rails 3.1+","Adds tagging with context and aggregation of tags for MongoMapper. Adds weight and distribution convenience methods to models in which it is included. Uses MongoDB's increment/decrement ($inc/$dec) to keep real-time counts of individual tags in context with optional type. Based on 'Mongoid Taggable With Context' (https://github.com/aq1018/mongoid_taggable_with_context)."],"Rails Captcha":["Simple question/answer based spam protection for your Rails models. You can define your own logic questions and/or fetch questions from the textcaptcha.com API. The questions involve human logic and are tough for spam bots to crack. For more reasons on why logic questions are a good idea visit; http://textcaptcha.com/why","BrainBuster - a logic captcha for Rails","A Google-style captcha for enterprise Rails apps","SimpleCaptcha is available to be used with Rails 3 or above and also it provides the backward compatibility with previous versions of Rails.","A smart captcha library","reCAPTCHA was too much for us, so we created this. Simplest captcha ever.","Captcha form Jike API","A plugin to make the process of creating a negative captcha in Rails much less painful","This plugin adds helpers for the reCAPTCHA API",""],"Wiki Apps":["Unobtrusive wiki that can be easily integrated into existing application","A small blog + wiki engine built on Sinatra + Stone","Wiki engine based on Rails 3 engine","A no-frills Merb wiki extracted from wiki.merbivore.com","Gitki is a wiki using git to store data.","A quick \u0026 dirty git-powered Sinatra wiki","A simple, Git-powered wiki with a sweet API and local frontend.","include Gollum into Rails with ease","a simple wiki powered by sinatra","Instiki is a Wiki Clone written in Ruby that ships with an embedded webserver. You can setup up an Instiki in just a few steps. Possibly the simplest wiki setup ever.","Irwi is Ruby on Rails plugin which adds wiki functionality to your application.","A Rails powered wiki with a sensible code base. Work in progress.","Olelo is a git-based wiki which supports many markup languages, tags, embedded TeX and much more. It can be extended through plugins.","An elegant wiki system for anyone who respects their grandmother","Wiki for Ramaze running on Innate","The easy to use rails wiki","A personal and collaborative wiki for Vim users","a sinatra/couchdb wiki"],"Rails Wizards":["A Rails plugin to make creating a wizard easy and with a lot less code","Multi-Step is a Rails engine for easily creating multi step forms (i.e. form wizard)","A Rails plugin that allows validation on partially completed Active Record models (useful in wizards that incrementally build a model).","Wicked is a Rails engine for producing easy wizard controllers","Create Rails Multi-Step Wizards instantly","Create wizards from any model in three steps"],"Rails Authentication":["A full featured library for working with Microsofts Active Directory in Ruby.","A clean, simple, and unobtrusive ruby authentication solution.","Authorization that includes basic authorization and 3 social authorization with Latvia social network draugiem.lv, facebook.com and twitter.com.","A gem providing Rails with authentication, Facebook Connect, MadMimi, and DelayedJob support","Rails authentication \u0026 authorization with email \u0026 password.","An authentication gem for the pre-production (mainly) phase of the application lifecycle. Provide a simple sign in page with a list of all users in the application. Click on any user logins you to the application under the user.","A Simple has_secure_password implementation","Flexible authentication solution for Rails with Warden","Rails3 engine that adds OAuth2 Provider support to any application built with Devise authentication","Doorkeeper is an OAuth 2 provider for Rails.","minimalistic authentication","simple rails authentication","A generalized Rack framework for multiple-provider authentication.","Simple CAS authentication for Rails, Sinatra or any Rack-based site","Generates common user authentication code for Rails/Merb, with a full test/unit and rspec suite and optional Acts as State Machine support built-in.","Helper to simplify RPX Now user login/creation","Provides common authentication needs such as signing in/out, activating by email and resetting password.","Easily switch current user to speed up development","Drop-in user login for mobile and web apps. Add a full user authentication stack to your application in minutes. Userbin is easily customized to fit your current design and infrastructure."],"Content Management":["cutting edge cms, blog, wiki, forum ...","Alchemy is a powerful, userfriendly and flexible Rails 3 CMS.","Open source Rails based content management that works.","Ruby/Rails Content Management Framework","BrowserCMS is a general purpose, open source Web Content Management System (CMS) that supports Ruby on Rails v3.2. It can be used as a standalone CMS, added to existing Rails projects or extended using Rails Engines.","Casein is an open-source CMS for Ruby on Rails.","ComfortableMexicanSofa is a powerful CMS Engine for Rails 4 applications","Serves mostly static pages with blocks of editable copy.","CMS system built on fullstack","LocomotiveCMS is a next generation CMS system with sexy admin tools, liquid templating, and inline editing powered by mongodb and rails 3.2","Manage Rails, application backend with ease.","A content management framework for Rails (compatible with 3.1 and 3.2)","Nesta is a lightweight Content Management System, written in Ruby using the Sinatra web framework. Nesta has the simplicity of a static site generator, but (being a fully fledged Rack application) allows you to serve dynamic content on demand. Content is stored on disk in plain text files (there is no database). Edit your content in a text editor and keep it under version control (most people use git, but any version control system will do fine). Implementing your site's design is easy, but Nesta also has a small selection of themes to choose from.","The Opal language for simplicity and Smalltalk-like syntax.","Puffer pages is integratable rails CMS with puffer admin interface","Radiant is a simple and powerful publishing system designed for small teams. It is built with Rails and is similar to Textpattern or MovableType, but is a general purpose content managment system--not merely a blogging engine.","Railfrog as a Rails Engine - DEVELOPERS ONLY","Railsyard - One Ruby on Rails CMS to rule them all!","A Ruby on Rails CMS that supports Rails 3.2. It's easy to extend and sticks to 'the Rails way' where possible.","Ruby on Rails Menus extension for Refinery CMS","Rails 3 engine that provides a Git backed CMS that allows for an admin to define editable regions in a page view.","The new Ruby on Rails open source standard in content management","Static.com Cloud Command Line Client","I like Rails but I also hate Rails, and sometimes I'm not making a web-app, and yet I still need a lot of the same plumbing for every app I make. This is an attempt to standardize that plumbing.","This gem provides a command-line interface to speed up the creation of ubiquo based apps.","Zen is a modular CMS written using Ramaze. Zen gives you complete freedom to build whatever you want in whatever way you might want to build it.","zena is a Ruby on Rails CMS (content managment system) with a focus on usability, ease of customization and web 2.0 goodness (application like behaviour)."],"Exception Notification":["Send your application errors to our hosted service and reclaim your inbox.","Ruby notifier for bugsnag.com","The open source error catcher that's Airbrake API compliant","Exceptional is the Ruby gem for communicating with http://exceptional.io (hosted error tracking service). Use it to find out about errors that happen in your live app. It captures lots of helpful information to help you fix the errors.","The Exception Engine logs your Rails exceptions in your mongodb database and provides a web interface to manage them","Exception notification for Rails apps","Make managing application errors a more pleasant experience.","Hoptoad notifier for rack-based frameworks","A gem that provides hoptoad notifications from rack","Exception Handling for Rails 3","Ruby Adapter for Raygun.io","Rails plugin to catch and send exceptions to Rollbar","A base library for Airbrake error reporting"],"Form Builders":["[Deprecated] A form builder that generates semantic HTML as advocated by Andy Budd in CSS Mastery.","bootstrap_form is a rails form builder that makes it super easy to create beautiful-looking forms using Twitter Bootstrapi 3+","Bootstrap Forms makes Twitter's Bootstrap on Rails easy to use by creating helpful form builders that minimize markup in your views.","Form builder for Haml","Unobtrusive nested forms handling, using jQuery. Use this and discover cocoon-heaven.","Adds some form helper to Rails (\u003E= 3.2).","A Rails form builder plugin/gem with semantically rich and accessible markup","Formula is a Rails form generator that generates simple clean markup. The project aims to let users create semantically beautiful forms without introducing too much syntax. The goal is to make integrating advanced layout systems as simple as possible.","Form builder for apps which use mongoid","Gem to conveniently handle multiple models in a single form with Rails 3 and jQuery or Prototype.","Client side validation with parsley and simple_form.","Forms made easy!","A custom Rails FormBuilder that assumes the use of Twitter Bootstrap"],"Pagination":["Loads page content into AJAX sections with AJAX links, handling the details for you, load content with javascript into designated page containers. Supports multiple and/or nested AJAX sections. Designed to be easy to use, customizable, supports browser history robustly, supports AJAX forms and has many more features. Degrades gracefully when javascript is disabled.","Paginate models with this named_scope method","Kaminari is a Scope \u0026 Engine based, clean, powerful, agnostic, customizable and sophisticated paginator for Rails 3+","Kaminari views for Twitter Bootstrap (rails engine)","PagedScopes is an ActiveRecord pagination gem. It lets you easily paginate collection associations and named scopes. It also paginates collections which already have :limit and :offset scopes in place. You can also find the page containing a given object in a collection, and find the next and previous objects for each object in the collection.","This gem is a simple paginator for Enumerable collections","Allows you to sort large datasets over many pages, without losing state.","will_paginate provides a simple API for performing paginated queries with Active Record, DataMapper and Sequel, and includes helpers for rendering pagination links in Rails, Sinatra and Merb web apps."],"Documentation Generators":["Rdoc template and generator for Ruby source code that uses javascript to make searching for methods and classes very easy.","Annotate your models and keep your comments about fields.","Rails REST API documentation tool","Produces UNIX manual pages for executable scripts.","Generate `Rakefile` with `docr` and get searchable documentation for ruby, rails, gems, plugins and all other ruby code in one place","Pretty documentation generator for Github projects with proper Readme.","ERBook 9.2.1 Write books, manuals, and documents in eRuby http://snk.tuxfamily.org/lib/erbook/ ERBook is an extensible document processor that emits [1]any document you can imagine from [2]eRuby templates, which allow scripting and dynamic content generation. Version 9.2.1 (2009-11-18) This release fixes some bugs in, and improves the readability and load time of, generated XHTML documents. Bug fixes * Prevent search button from starting search when search box untouched. * Prevent browser from fetching base-64 embedded URI sources by qualifying their digests with the \"cid\" URI schema, which is used to identify the parts of a multi-part e-mail message. This cuts down on the amount of \"404 - File Not Found\" errors on the web server which hosts your generated XHTML documents because web browsers will not confuse these embedded \"cid\" digests as being relative HTTP files. Housekeeping * Increase vertical spacing between [3]References for better readability. * Embed W3C validator badges as base-64 data URIs to reduce page load time. * Split the document processing code in ERBook::Document into smaller self-documenting methods. References 1. http://snk.tuxfamily.org/lib/erbook/#HelloWorld 2. http://en.wikipedia.org/wiki/ERuby 3. http://snk.tuxfamily.org/lib/erbook/#_references","Hanna is an RDoc implemented in Haml, making its source clean and maintainable. It's built with simplicity, beauty and ease of browsing in mind.","Converts markdown documents into UNIX manual pages.","RDoc produces HTML and command-line documentation for Ruby projects. RDoc includes the +rdoc+ and +ri+ tools for generating and displaying documentation from the command-line.","Docco in Ruby","Builds manuals","Generate API docs from your test suite","rdoc generator html with javascript search index.","YARD is a documentation generation tool for the Ruby programming language. It enables the user to generate consistent, usable documentation that can be exported to a number of formats very easily, and also supports extending for custom Ruby constructs such as custom class level definitions."],"Browser testing":["Headless Browser for Integration Testing with Capybara","Capybara is an integration testing tool for rack based web applications. It simulates how a user would interact with a website","Headless Webkit driver for Capybara","Celerity is a JRuby wrapper around HtmlUnit â a headless Java browser with JavaScript support. It provides a simple API for programmatic navigation through web applications. Celerity provides a superset of Watir's API.","Culerity integrates Cucumber and Celerity in order to test your application's full stack.","Headless is a Ruby interface for Xvfb. It allows you to create a headless display straight from Ruby code, hiding some low-level action.","Selenium RC with Rails integration and enhanced assertions.","Poltergeist is a driver for Capybara that allows you to run your tests on a headless WebKit browser, provided by PhantomJS.","Official Ruby Client for Selenium RC.","The \"official\" Selenium On Rails repository, synced with OpenQA.","WebDriver is a tool for writing automated tests of websites. It aims to mimic the behaviour of a real user, and as such interacts with the HTML of the application.","SitePrism gives you a simple, clean and semantic DSL for describing your site using the Page Object Model pattern, for use with Capybara","Simple page objects for Capybara. All tooth-generated methods return Capybara Elements so that you can use these familiar objects for your needs.","Automated testing tool for web applications. By Testers. For Testers.","WebDriver-backed Watir","Webrat lets you quickly write expressive and robust acceptance tests for a Ruby web application. It supports simulating a browser inside a Ruby process to avoid the performance hit and browser dependency of Selenium or Watir, but the same API can also be used to drive real Selenium tests when necessary (eg. for testing AJAX interactions). Most Ruby web frameworks and testing frameworks are supported."],"Spam Detection":["Spam protection with Akismet and Typepad","ActiveModel plugin for Defensio.","Official Ruby library for Defensio API 2.0","Rakismet is the easiest way to integrate Akismet or TypePad's AntiSpam into your Rails app.","A framework agnostic Defensio Ruby library.","Modernized gem version of the Viking plugin"],"Syntax Highlighting":["Albeano lets you to write language specifics code snippets within text and returns Pygments generated HTML syntax highlighted code","Ruby wrapper for pygmentize.","Fast and easy syntax highlighting for selected languages, written in Ruby. Comes with RedCloth integration and LOC counter.","Converts source code into a (bookmarked, themed, and syntax highlighted!) PDF.","Harsh: Another Rails Syntax Highlighter. Ultraviolet-based syntax highlighting for rails, for ERb or Haml. Better than the rest.","Highlight highlights code in more than 20 languages. It uses the Pygments syntax highlighter and adds a simple Ruby API over it. It also provides helpers for use in your Ruby on Rails views.","Ink is a wrapper for Pygments, a nice Python syntax highlighting library and formatters like RDoc, Markdown and Textile.","JavaScript client-side syntax highlighting.","This Rack middleware component uses the CodeRay gem to automatically format code syntax by detecting a specific container in the final rendered markup.","Rack middleware used to automagically format your code blocks using pygmentize","Rouge aims to a be a simple, easy-to-extend drop-in replacement for pygments.","a gem to get syntaxhilight via ultraviolet","web service for formatting text with the ultraviolet lib.  ruby 1.9 only","Ultraviolet syntax highlighting gem for Ruby18 and Ruby19"],"CRM Apps":["A fully featured CRM / Newsletter and Mailings Module for Alchemy CMS. Building and sending Newsletters has never been easier!","The Cohort CRM - a tag-heavy Rails-based CRM","Ruby on Rails CRM platform for Web 2.0 and beyond","An ultralight CRM framework","Mongodb + Mongoid + Rails 3 example app (out-dated)","MyIT CRM 2 is a total re-write from the ground up in Ruby/Rails language. MyITCRM2 is a CRM program designed for the Businesses who repair equipment like Computers, Small Plant or can be also used to manage maintenance tasks. The software is still not at an ALPHA stage yet but please fell free to join the project and help create a community driven software solution.","Description","Ruby on Rails CRM for lead tracking made with MongoDB, Twitter Bootstrap and Devise.  It is intended to be a no fluff working application and not an over loaded application."],"irb Tools":["Creates aliases for class methods, instance methods, constants, delegated methods and more. Aliases can be easily searched or saved as YAML config files to load later. Custom alias types are easy to create with the DSL Alias provides. Although Alias was created with the irb user in mind, any Ruby console program can hook into Alias for creating configurable aliases.","Great Ruby dubugging companion: pretty print Ruby objects to visualize their structure. Supports custom object formatting via plugins","Bond is on a mission to improve autocompletion in ruby, especially for irb/ripl. Aside from doing everything irb's can do and fixing its quirks, Bond can autocomplete argument(s) to methods, uniquely completing per module, per method and per argument. Bond brings ruby autocompletion closer to bash/zsh as it provides a configuration system and a DSL for creating custom completions and completion rules. With this configuration system, users can customize their autocompletions and share it with others. Bond can also load completions that ship with gems. Bond is able to offer more than irb's completion since it uses the full line of input when completing as opposed to irb's last-word approach.","Easy access to the clipboard on Linux, MacOS and Windows (Clipboard.copy \u0026 Clipboard.paste).","config files for zsh, bash, completions, gem, git, irb, rails","every_day_irb defines helper methods that simplify life in irb.: ls, cat, rq, rrq, ld, session_history, reset!, clear, ...","FancyIrb patches your IRB to create a smooth output experience. You can colorize the prompts, irb errors, stderr and stdout, output your result as #=\u003E (hash rockets) and some other improvements.","Hirb provides a mini view framework for console applications and uses it to improve ripl(irb)'s default inspect output. Given an object or array of objects, hirb renders a view based on the object's class and/or ancestry. Hirb offers reusable views in the form of helper classes. The two main helpers, Hirb::Helpers::Table and Hirb::Helpers::Tree, provide several options for generating ascii tables and trees. Using Hirb::Helpers::AutoTable, hirb has useful default views for at least ten popular database gems i.e. Rails' ActiveRecord::Base. Other than views, hirb offers a smart pager and a console menu. The smart pager only pages when the output exceeds the current screen size. The menu is used in conjunction with tables to offer two dimensional menus.","Use vim (or any other text editor) from inside irb to quickly test \u0026 write new code.","irbtools makes using Ruby's IRB easier and more fun. Put a require 'irbtools' in a .irbrc file in your home directory to get started.","irbtools-more adds bond and looksee to IRB (Gems that use core extensions). Simply put a require \"irbtools/more\" in the .irbrc file in your home directory to get started.","Supercharged method introspection in IRB.","MarcoPolo shows your app name and environment in your console prompt so you don't accidentally break production","Object-Oriented RI for IRB Console","Use Pry as your rails console","Console for any Rack based ruby web app","Statistics + IRB console","Sketches allows you to create and edit Ruby code from the comfort of your editor, while having it safely reloaded in IRB whenever changes to the code are saved.","TablePrint turns objects into nicely formatted columns for easy reading. Works great in rails console, works on pure ruby objects, autodetects columns, lets you traverse ActiveRecord associations. Simple, powerful.","IRB Power User Utility Belt","Wavy IRB: Colorizes irb results. It originated from Wirble, but only provides result highlighting. Just call Wirb.start and enjoy the colors in your IRB ;). You can use it with your favorite colorizer engine. See README.rdoc for more details.","Handful of common Irb features, made easy."],"Forum Systems":["Ground-up rewrite of Beast, a Ruby on Rails forum.","Engage! is a Rails gem that adds a user support forum to your Rails application.","The best Rails 3 and Rails 4 forum engine. Ever.","A Simple Rails 3 Forum Generator","A rails forum engine"],"Amazon Web Services":["A Ruby library for accessing the Amazon Web Services EC2, ELB, RDS, Cloudwatch, and Autoscaling APIs.","A easy way to interact with Amazon SES.","AWS Ruby Library for interfacing with Amazon Web Services including EC2, S3, SQS, SimpleDB and most of their other services as well. By http://www.appoxy.com","Client library for Amazon's Simple Storage Service's REST API","AWS SDK for Ruby","Client library for Amazon's Simple Email Service's REST API","ec2-blackout is a command line tool to shutdown EC2 instances. It's main purpose is to save you money by stopping EC2 instances during out of office hours.","The Ruby cloud services library. Supports all major cloud providers including AWS, Rackspace, Linode, Blue Box, StormOnDemand, and many others. Full support for most AWS services including EC2, S3, CloudWatch, SimpleDB, ELB, and RDS.","== DESCRIPTION: The RightScale AWS gems have been designed to provide a robust, fast, and secure interface to Amazon EC2, EBS, S3, SQS, SDB, and CloudFront. These gems have been used in production by RightScale since late 2006 and are being maintained to track enhancements made by Amazon. The RightScale AWS gems comprise: - RightAws::Ec2 -- interface to Amazon EC2 (Elastic Compute Cloud) and the associated EBS (Elastic Block Store) - RightAws::S3 and RightAws::S3Interface -- interface to Amazon S3 (Simple Storage Service) - RightAws::Sqs and RightAws::SqsInterface -- interface to first-generation Amazon SQS (Simple Queue Service) (API version 2007-05-01) - RightAws::SqsGen2 and RightAws::SqsGen2Interface -- interface to second-generation Amazon SQS (Simple Queue Service) (API version 2008-01-01) - RightAws::SdbInterface and RightAws::ActiveSdb -- interface to Amazon SDB (SimpleDB) - RightAws::AcfInterface -- interface to Amazon CloudFront, a content distribution service == FEATURES: - Full programmmatic access to EC2, EBS, S3, SQS, SDB, and CloudFront. - Complete error handling: all operations check for errors and report complete error information by raising an AwsError. - Persistent HTTP connections with robust network-level retry layer using RightHttpConnection). This includes socket timeouts and retries. - Robust HTTP-level retry layer. Certain (user-adjustable) HTTP errors returned by Amazon's services are classified as temporary errors. These errors are automaticallly retried using exponentially increasing intervals. The number of retries is user-configurable. - Fast REXML-based parsing of responses (as fast as a pure Ruby solution allows). - Uses libxml (if available) for faster response parsing. - Support for large S3 list operations. Buckets and key subfolders containing many (\u003E 1000) keys are listed in entirety. Operations based on list (like bucket clear) work on arbitrary numbers of keys. - Support for streaming GETs from S3, and streaming PUTs to S3 if the data source is a file. - Support for single-threaded usage, multithreaded usage, as well as usage with multiple AWS accounts. - Support for both first- and second-generation SQS (API versions 2007-05-01 and 2008-01-01). These versions of SQS are not compatible. - Support for signature versions 0 and 1 on SQS, SDB, and EC2. - Interoperability with any cloud running Eucalyptus (http://eucalyptus.cs.ucsb.edu) - Test suite (requires AWS account to do \"live\" testing).","S3 library provides access to Amazon's Simple Storage Service. It supports both: European and US buckets through REST API.","Provides a s3cmd binary to perform simple commands on buckets and objects in s3. See \u003Ca href=\"https://github.com/jasmeetc/s3utils\"\u003E Github S3utils page \u003C/a\u003E for more. Also, feel free to leave an issue on the github page, if you run into anything","Virtual File System - simple and unified API over different storages (Local, S3, SFTP, ...)"],"API Clients":["Generic Amazon Product Advertising Ruby API.","A nice rubyish interface to the Amazon Product Advertising API, formerly known as the Associates Web Service and before that the Amazon E-Commerce Service.","A Ruby interface to the Google Analytics API","Wrapper for Arena's API","Amazon Simple INterface - Support for ItemLookup, SimilarityLookup, Search, BrowseNode and Cart Operations.","Use the bit.ly API to shorten or expand URLs","Ruby gem for accessing the Campaign Monitor API","Ruby interface to the Clickatell SMS gateway service.","A simple ruby client for Digital Ocean API","A universal interface to grab contact list information from various providers including Yahoo, AOL, Gmail, Hotmail, and Plaxo.","Implements the complete functionality of the Campaign Monitor API.","Provides clean Disqus API for your Ruby app with a nice interface.","eBay4R is a Ruby wrapper for eBay's Web Services SOAP API. Emphasis is on ease of use and small footprint.","Ruby wrapper for the Google Time Zone API","A simple POC facebook chat client written in Ruby using Facebook's internal Comet API","A full-stack Facebook Graph API wrapper in Ruby.","Provides an interface to Fedex Web Services(version 10) - shipping rates, generate labels and address validation","Simpe unofficial Feedly API wrapper. No auth yet.","Flickr library with a syntax close to the syntax described on http://www.flickr.com/services/api","Provides a ruby interface to flickr via the REST api","Generic Ruby interface to look up nutritional information on food. Design is modular so other adapters can be plugged in, but only data source currently implemented is FatSecret.","Gives access to all endpoints in version 2 of foursquare's API with syntax that will be familiar to those who used the original foursquare gem by Jeremy Welch.","foursquare-api is a Ruby wrapper for the new Foursqauare V2 API","A simple gem to easily use the Facebook Query Language. Just specify single queries as strings or use hashes to compose multiqueries and send them to Facebook using `Fql.execute(query)`.","A wrapper for MailChimp API 2.0 and Export API 1.0","Ruby wrapper that supports all of the GitHub API v3 methods(nearly 200). It's build in a modular way, that is, you can either instantiate the whole api wrapper Github.new or use parts of it e.i. Github::Repos.new if working solely with repositories is your main concern.","Ruby library for working with the Gnip Rules API","Rails plugin: implements Google's Content Delivery Network for all javascript libraries currently supported by their library API.","A minimal wrapper around the google calendar API, which uses nokogiri for fast parsing.","Rails 3 plugin using Google's Safe Browsing API for url lookup against Malware and Phishing blacklists. Implementation includes storing and updating locally stored shavar lists and url lookup methods.","Simple client for Google Translate API.","Grackle is a lightweight library for the Twitter REST API designed to be resilient to Twitter API changes or errors.","Simple wrapper for the GroupMe v3 API","Hominid is a Ruby gem that provides a wrapper for interacting with the Mailchimp email marketing service MC, STS and Export API's.","Connect to Hudson's remote web API","Easily use Ruby or the command line to find information on IMDB.com.","This is a simple and easy-to-use Jenkins Api client with features focused on automating Job configuration programaticaly and so forth","Koala is a lightweight, flexible Ruby SDK for Facebook. It allows read/write access to the social graph via the Graph and REST APIs, as well as support for realtime updates and OAuth and Facebook Connect authentication. Koala is fully tested and supports Net::HTTP and Typhoeus connections out of the box and can accept custom modules for other services.","Ruby API wrapper for Lighthouse - http://lighthouseapp.com","Ruby wrapper for the LinkedIn API","Simple ruby client interface to the Mixpanel API.","MusicBrainz Web Service wrapper with ActiveRecord-style models","This library provides an interface to NetSuite via'RESTlets'. This appears to be a quicker and more reliableway of interfacing with NetSuite records than the SOAP API.","Simple wrapper for the GitHub API","A Ruby interface to GitHub API v2","A Foursquare API wrapper","Client for the RESTful JSON ebay finding and shopping api","== DESCRIPTION: The RightScale GoGrid gem has been designed to provide a robust interface to Flexiscale\u0026#8216;s existing API. == FEATURES/PROBLEMS: * Full programmatic access to the Flexiscale API. * Complete error handling: all operations check for errors and report complete error information.","Ruby Wrapper for the jiffybox.de API","This gem is an updated version of jnunemakers scrobbler gem. Rockstar uses v2.0 of the last.fm api.","Sending sms with Routo Messaging HTTP API.","A simple bit.ly ruby client","Ruby API for Cloud Files","Client for the DMM Web Service API 2.0.","Ruby-GitHub is a simple wrapper library for the evolving GitHub API.","Runkeeper API client.","A ruby interface for the latest activites on RunKeeper","This gem is a ruby client for the SemRush API.","Now you can send sms messages to your users.","Spotlite gem helps you fetch all kinds of publicly available information about movies and people from IMDb movie website, including title, year, genres, directors, writers, actors, runtime, countries, poster, keywords, etc.","Ruby wrapper for the Tick API http://tickspot.com/api","A Ruby API for interfacing with Campfire, the 37Signals chat application.","Yet another Twitter API wrapper library in Ruby","a command line utility and library which interfaces to the excellent tumblr blogging platform","TweetStream is a simple wrapper for consuming the Twitter Streaming API.","A Ruby interface to the Twitter API.","A clean Twitter client API in pure Ruby. Will include Twitter add-ons also in Ruby.","wrappers for various twitter apis","twitter_oauth is a Ruby client for the Twitter API using OAuth.","Ruby wrapper for the Twitter Search API.","Simple Ruby client library for twitter streaming API. Uses EventMachine for connection handling. Adheres to twitter's reconnection guidline. JSON format only.","A wrapper to the Amazon Product Advertising API","Get video info from Dailymotion, Vimeo, VK and YouTube url.","A full featured Ruby implementation of the Vimeo API.","Ruby wrapper for vk.com API","Ruby WebFinger client library","Ruby wrapper over the Wikipedia API","WWW::Delicious is a del.icio.us API client implemented in Ruby. It provides access to all available del.icio.us API queries and returns the original XML response as a friendly Ruby object.","Upload, delete, update, comment on youtube videos all from one gem.","This gem implements a wrapper to the SOAP control API provided by Zeus Load Balancer (ZLB) and Zeus Traffic Manager (ZTM)."],"Active Record Index Assistants":["Pain-free indexing to speed up your Rails app","Automatic Foreign Key automatically generates foreign-key constraints when creating tables or adding columns. It uses SQL-92 syntax and as such should be compatible with most databases that support foreign-key constraints.","Adds helpers to migrations and dumps foreign keys to schema.rb","Adds a generator for creating a foreign key migration based on your current model associations","lol_dba is a small package of rake tasks that scan your application models and displays a list of columns that probably should be indexed. Also, it can generate .sql migration scripts.","A rake task to track down missing database indexes. does not assume that all foreign keys end with the convention of _id.","Adds support in ActiveRecord for foreign_keys, complex indexes and other database-related stuff. Easily create foreign_keys, complex indexes and views.","SchemaPlus is an ActiveRecord extension that provides enhanced capabilities for schema definition and querying, including: enhanced and more DRY index capabilities, support and automation for foreign key constraints, and support for views."],"Server Monitoring":["With Amnesia you'll know exactly whats happening with memory when it comes to memcached.","Elegant server and web application monitoring","Bluepill keeps your daemons up while taking up as little resources as possible. After all you probably want the resources of your server to be used by whatever daemons you are running rather than the thing that's supposed to make sure they are brought back up, should they die or misbehave.","Process monitoring tool. Inspired from Bluepill and God. Requires Ruby(MRI) \u003E= 1.9.3-p194. Uses Celluloid and Celluloid::IO.","An easy to configure, easy to extend monitoring framework written in Ruby.","Simple health-checker as rack middleware","Monitor all aspects of your applications health.","Health rails gives you some default checks and a DSL for defining your own checks.","An easy to use DSL for building custom probes for the Nagios monitoring system","Provides endpoint for NewRelic HTTP ping monitoring for Rails applications","Simple service monitoring with a clean DSL for configuration.","A monitoring framework that aims to be simple, malleable, and scalable. Uses the publish/subscribe model.","Visage is a web interface for viewing collectd statistics. It also provides a JSON interface onto collectd's RRD data, giving you an easy way to mash up the data.","Monitor server CPU/Memory/Disk Usage/URL Loading, so that you can view those statistics on a web page, as well as providing an interface to client prorams to read those statistics."],"Web Content Scrapers":["Anemone web-spider framework","Cobweb is a web crawler that can use resque to cluster crawls to quickly crawl extremely large sites which is much more performant than multi-threaded crawlers. It is also a standalone crawler that has a sophisticated statistics monitoring interface to monitor the progress of the crawls.","Download, pull out of a ZIP/TAR/GZ/BZ2 archive, parse, correct, and import XLS, ODS, XML, CSV, HTML, etc. into your ActiveRecord models. Uses Upsert internally for speed.","DocParser is a Ruby Gem for webscraping","Easily fetch product information from third party websites such as Amazon, Steam, eBay, etc.","Ruby gem generating thumbnail images from a given URL.","MetaInspector lets you scrape a web page and get its title, charset, link and meta tags","Pismo extracts and retrieves content-related metadata from HTML pages - you can use the resulting data in an organized way, such as a summary/first paragraph, body text, keywords, RSS feed URL, favicon, etc.","Crawl web sites easily using ruby recipes, with caching and nokogiri.","A simple plugin for extracting information from url entered by user (Something like what facebook does). This gem is built on top of opengraph gem created by michael bleigh."],"CSS with Ruby":["Bootstrap CSS (with Sass flavour) and JS toolkits for Rails 3 projects","Twitter's Bootstrap, converted to Sass and ready to drop into Rails or Compass","The purpose of Bourbon Vanilla Sass Mixins is to provide a comprehensive framework of sass mixins that are designed to be as vanilla as possible. Meaning they should not deter from the original CSS syntax. The mixins contain vendor specific prefixes for all CSS3 properties for support amongst modern browsers. The prefixes also ensure graceful degradation for older browsers that support only CSS3 prefixed properties.","Compass is a Sass-based Stylesheet Framework that streamlines the creation and maintainance of CSS.","[Deprecated] DRY stylesheets with nested selectors and variables.  No new syntax to learn :-)","A coverage tool for finding unused CSS","Invoke the Less CSS compiler from Ruby","Leaner CSS, in your browser or Ruby (via less.js).","General styling patterns in SASS","A CSS compressor","Sass makes CSS fun again. Sass is an extension of CSS3, adding nested rules, variables, mixins, selector inheritance, and more. It's translated to well-formatted, standard CSS using the command line tool or a web-framework plugin.","Sass adapter for the Rails asset pipeline.","Smurfville is the home of SMURF, a new and modular approach to Rails frontend development based on the SMACSS approach for CSS. This gem provides a set of tools that help following this approach.","A Ruby library for generating cascading stylesheets.","Bridge library to compile .styl stylesheets from ruby code.","twitter-bootstrap-rails project integrates Bootstrap CSS toolkit for Rails 3.1 Asset Pipeline","twitter-bootswatch-rails gem integrates Bootstrap for Rails Asset Pipeline with less-rails","FontAwesome toolkit for twitter-bootswatch-rails gem for Rails Asset Pipeline with less-rails","twitter-bootswatch-rails-helpers gem provides common view helpers for use with the twitter-bootswatch-rails gem"],"Terminal Coloring":["The ANSI project is a superlative collection of ANSI escape code related libraries enabling ANSI colorization and stylization of console output. Byte for byte ANSI is the best ANSI code library available for the Ruby programming language.","\u003E\u003E puts \"this is red\".red \u003E\u003E puts \"this is red with a blue background (read: ugly)\".red_on_blue \u003E\u003E puts \"this is red with an underline\".red.underline \u003E\u003E puts \"this is really bold and really blue\".bold.blue \u003E\u003E logger.debug \"hey this is broken!\".red_on_yellow # in rails \u003E\u003E puts Color.red \"This is red\" # but this part is mostly untested","Ruby String class extension. Adds methods to set text color, background color and, text effects on ruby console and command line output, using ANSI escape sequences.","Rainbows and unicorns!","Terminal painter / no string extensions / 256 color support / effect support / define custom shortcuts / basic usage: Paint['string', :red, :bright]","Colorize printed text on ANSI terminals","This library uses ANSI escape sequences to control the attributes of terminal output"],"Bundler Tools":["Appraisal integrates with bundler and rake to test your library against different versions of dependencies in repeatable scenarios called \"appraisals.\"","Attempt to update every single gem of your Gemfile to its latest patch, minor then major release. Runs a test command to ensure the update succeeded","Guard::Bundler automatically install/update your gem bundle when needed","Stop using bundle exec.","Stop using bundle exec. Integrate Rubygems and Bundler. Make rubygems generate bundler aware executable wrappers.","Use bundler to generate gem tarball packages."],"Rails App Templates":["The App Scrolls is a magical tool to generate new Rails and modify existing Rails applications (coming) to include your favourite, powerful magic.","Appsta is designed to make bootstrapping new Rails applications much easier.","Heavyweight template for Rails 2.3.x","Community Base Application Template","Rails 4.x template with responder, simple form, haml, exception notification, etc etc ...","","Generate a Rails 3.2.6 app with the Mongoid ORM (or OM) and RSpec for BDD testing.","Generate a Rails 3 app with application templates Quick Left uses to start their projects off right!","Deprecated (no longer maintained). Use the Rails Composer tool instead.","A gem with recipes to create Rails application templates you can use to generate Rails starter apps.","based on the awesome rg by mrn","Template generator for Ruby on Rails 3 applications","A library of neat Rails application templates.","Suspenders is a base Rails project that you can upgrade. It is used by thoughtbot to get a jump start on a working app. Use Suspenders if you're in a rush to build something amazing; don't use it if you like missing deadlines.","This gem preps a new Rails app with some of the best Rails gems and Jquery sweetness available( Twitter-Bootstrap, Devise, CanCan, Rails Admin, Spreadsheet, ) Not only does it takes care of the installation of these gems, it also extends your scaffolds to give aesthetically improved views. Further, apart from the standard scaffold views, it also creates an AJAX driven integrated view for your scaffold. It dries up your controllers and makes your models friendlier by adding schema stubs and standard validation options. Expect Cucumber integration in our next version"],"Text Editors in Ruby":["Arcadia Ide","Diakonos is a customizable, usable console-based text editor.","A pure Ruby text editor","Ruber is a Ruby editor for KDE 4 written in pure ruby, making use of the excellent ruby bindings for KDE 4 (korundum). Ruber is plugin-based, meaning that almost all its functionality is provided by plugins. This has two important consequences: 1) A user can write plugins having availlable all the features availlable to the Ruber developers. In other words, there's not a plugin-specifi API 2) Users can write plugins which replace some of the core functionality of \\ Ruber. For example, a user can create a plugin which replaces the default plugin to run ruby programs","Desktop-style, Intuitive, Commandline Editor in Ruby. 'Better than nano, simpler than vim.'"],"Music \u0026 MIDI":["Ruby MIDI DJing/live-coding thing","COmpact Sequencing sYntax","A console music library explorer and player","MIDI arpeggiator in Ruby","A Ruby DSL for generating Lilypond guitar tablatures.","Jazz Model - A data model for Jazz theory and other cool stuff.","A Ruby DSL for MIDI","A nice Ruby interface to your system's MIDI services. MIDIator was inspired by Topher Cyll's fantastic Practical Ruby Projects book. In it, Topher describes how to interact with the MIDI providers in OSX, Linux, and Windows. As I was reading the book, I noticed some things I would do differently, which got me thinking that maybe it would be valuable to package up my modifications to the book's code and release it as a gem.","midilib is a pure Ruby MIDI library useful for reading and writing standard MIDI files and manipulating MIDI event data.","Ruby bindings for OS X's high-quality music sequencing API","PatchMaster is a MIDI processing and patching system. It allows a musician to reconfigure a MIDI setup instantaneously and modify the MIDI data in real time.","Ruby Music and Midi App there are currently two different apps one for playing live and the other for writing to a midi file..Currently working on creating the chord System and is requesting ideas that you the user would like to see come out of a app like this..","Platform Independent, realtime MIDI input and output for Ruby"],"Breadcrumb Builders":["Ariane is a flexible breadcrumb system for Rails. It is fully compatible with the Twitter Bootstrap and can be adapted to any kind of output.","A breadcrumbs plugin for Ruby on Rails 3 and Rails 4.0.","Breadcrumbs is a simple plugin that adds a `breadcrumbs` object to controllers and views.","BreadcrumbsOnRails is a simple Ruby on Rails plugin for creating and managing a breadcrumb navigation for a Rails project.","How did these breadcrumbs in your Rails application? Oh right, with this plugin!","Crummy is a simple and tasty way to add breadcrumbs to your Rails applications.","Gretel is a Ruby on Rails plugin that makes it easy yet flexible to create breadcrumbs."],"Mocking Web Requests":["Replaces Net::HTTP with a subclass that routes all requests to a Rack application","FakeWeb is a helper for faking web requests in Ruby. It works at a global level, without modifying code or writing extensive stubs.","The jQuery Mockjax Plugin provides a simple and extremely flexible interface for mocking or simulating ajax requests and responses","A webmock DSL using sinatra.","Record network responses for easy stubbing of external calls","Real stubs and spies for HTTP(S) services","API for Testing Rack Applications via Mock HTTP","Stub HTTP responses","VCR provides a simple API to record and replay your test suite's HTTP interactions. It works with a variety of HTTP client libraries, HTTP stubbing libraries and testing frameworks.","WebMock allows stubbing HTTP requests and setting expectations on HTTP requests."],"Cucumber Steps":["CLI Steps for Cucumber, hand-crafted for you in Aruba","Cucumber Factory allows you to create ActiveRecord models from your Cucumber features without writing step definitions for each model.","A library of cucumber step definitions, which allow you to use a human to assert conditions during acceptance tests. Some requirements are simple for a human to confirm, but are very difficult to assert using automation. Farmer allows us to include human confirmation into our normal testing flow. For example, we needed to verify that certain portions of an image were 'blacked out'.","Easily test email in RSpec, Cucumber, and MiniTest","Expand Cucumber with macro-steps.","MundoPepino is a set of reusable step definitions to test Rails apps with Cucumber","Easy model creation and reference in your cucumber features"],"Unit Test Frameworks":["Test::Unit style testing framework, just better than Test::Unit.","Bacon is a small RSpec clone weighing less than 350 LoC but nevertheless providing all essential features. http://github.com/chneukirchen/bacon","Detest is an assertion testing library for [Ruby] that features a simple\r assertion vocabulary, instant debuggability of failures, and flexibility in\r composing tests.","DTF is a modular testing framework skeleton. This is the control gem containing the db schema(s) and command-line script.","It's for writing tests.","Lemon is a unit testing framework that tightly correlates class to test case and method to test unit.","An excellent replacement for the wheel...","minitest provides a complete suite of testing facilities supporting TDD, BDD, mocking, and benchmarking. \"I had a class with Jim Weirich on testing last week and we were allowed to choose our testing frameworks. Kirk Haines and I were paired up and we cracked open the code for a few test frameworks... I MUST say that minitest is *very* readable / understandable compared to the 'other two' options we looked at. Nicely done and thank you for helping us keep our mental sanity.\" -- Wayne E. Seguin minitest/unit is a small and incredibly fast unit testing framework. It provides a rich set of assertions to make your tests clean and readable. minitest/spec is a functionally complete spec engine. It hooks onto minitest/unit and seamlessly bridges test assertions over to spec expectations. minitest/benchmark is an awesome way to assert the performance of your algorithms in a repeatable manner. Now you can assert that your newb co-worker doesn't replace your linear algorithm with an exponential one! minitest/mock by Steven Baker, is a beautifully tiny mock (and stub) object framework. minitest/pride shows pride in testing and adds coloring to your test output. I guess it is an example of how to write IO pipes too. :P minitest/unit is meant to have a clean implementation for language implementors that need a minimal set of methods to bootstrap a working test suite. For example, there is no magic involved for test-case discovery. \"Again, I can't praise enough the idea of a testing/specing framework that I can actually read in full in one sitting!\" -- Piotr Szotkowski Comparing to rspec: rspec is a testing DSL. minitest is ruby. -- Adam Hawkins, \"Bow Before MiniTest\" minitest doesn't reinvent anything that ruby already provides, like: classes, modules, inheritance, methods. This means you only have to learn ruby to use minitest and all of your regular OO practices like extract-method refactorings still apply.","An extremely fast, expressive, and context-driven unit-testing framework. A replacement for all other testing frameworks. Protest the slow test.","BDD for Ruby","Ruby version of Python's doctest tool, but a bit different.","Work with your tests, not against them.","test_inline allows you to place your automated testing right next to the code being tested much like RDoc allows you to put your documentation right next to the code being documented. See the README for the rational for why you would want to do this.","A super lightweight testing library for Ruby","Ruby 1.9.x bundles minitest not Test::Unit. Test::Unit bundled in Ruby 1.8.x had not been improved but unbundled Test::Unit (test-unit) is improved actively.","testy","Wrong provides a general assert method that takes a predicate block. Assertion failure messages are rich in detail. The Wrong idea is to replace all those countless assert_this, assert_that library methods which only exist to give a more useful failure message than \"assertion failed\". Wrong replaces all of them in one fell swoop, since if you can write it in Ruby, Wrong can make a sensible failure message out of it. Also provided are several helper methods, like rescuing, capturing, and d."],"Asset Distribution":["This gem allows you to copy your static assets to include a unique hash in their filename. By using this and modifying your Rails asset path you can easily enable your Rails application to serve static content using CloudFront with a custom origin policy.","After you run assets:precompile your compiled assets will be synchronised with your S3 bucket.","Easy deployment of your assets on CloudFront or S3 using a simple rake-task. When enabled in production, the application's asset_host and public_paths will point to the correct location.","Jammit-S3 is an extension to the awesome Jammit library that handles deployment to s3 and cloudfront."],"Backups":["Astrails-Safe is a simple tool to backup databases (MySQL and PostgreSQL), Subversion repositories (with svndump) and just files. Backups can be stored locally or remotely and can be enctypted. Remote storage is supported on Amazon S3, Rackspace Cloud Files, or just plain FTP/SFTP.","Backup is a RubyGem, written for UNIX-like operating systems, that allows you to easily perform backup operations on both your remote and local environments. It provides you with an elegant DSL in Ruby for modeling your backups. Backup has built-in support for various databases, storage protocols/services, syncers, compressors, encryptors and notifiers which you can mix and match. It was built with modularity, extensibility and simplicity in mind.","Makes Amazon S3 backups redonkulous. Redonkulously easy, that is.","A tool to backup your servers","db2fog provides rake tasks for backing up and restoring your DB to cloud storage providers","db2s3 provides rake tasks for backing up and restoring your DB to S3","helps manage db dumps and imports via rake tasks","Backup your dotfiles to dropbox and restore them easily.","Dumper is a backup management system that offers a whole new way to take daily backups of your databases.","Capistrano and Rake tasks for cloning production and/or staging databases and assets to development.","Simple mechanism to configure and execute backups of folders and MySQL DBs and store them in local folder or S3 bucket"],"Rails File Uploads":["Attached is a Ruby on Rails cloud attachment and processor library inspired by Paperclip. Attached lets users push files to the cloud, then perform remote processing on the files.","Treat an ActiveRecord model as a file attachment, storing its patch, size, content type, etc.","Upload files in your Ruby applications, map them to a range of ORMs, store them on different backends.","Dragonfly is a framework that enables on-the-fly processing for any content type. It is especially suited to image handling. Its uses range from image thumbnails to standard attachments to on-demand text generation.","A FilePicker / PaperClip mashup. Use Filepicker for uploads and paperclip to process them.","Fine Uploader by Andrew Valums integrated for Rails 3.1+ Asset Pipeline","Clean \u0026 light interface around GraphicsMagick.","This gem packages jQuery File Upload plugin and it's dependencies for Rails asset pipeline.","Easy upload management for ActiveRecord","Paperclip Swfupload UploadHelper wrapper","simple-image-uploader creates Image scaffold with file upload and removal. It is based on carrierwave and mini-imagegick gems. Image model, controller and form are have simple code that allows any application to use image upload immediately. Add simple-image-uploader gem to your Gemfile. Run bundle install. Then run 'rails g simple_image_uploader'. Run rails s and check http://localhost:3000/images."],"Encryption":["Generates attr_accessors that encrypt and decrypt attributes transparently","Transparent encryption for ActiveRecord that isn't over-engineered","Dead-simple string encryption/decryption syntax","Reversible, secure secret storing for your rails model using public/private key encryption and acts_as_lockbox.","Rails plugin to transparently encrypt attributes","A library for storing encrypted data in Mongo","This module allows Ruby programs to interface with \"RSA Security Inc. PKCS #11 Cryptographic Token Interface (Cryptoki)\".","Sentry provides painless encryption services with a wrapper around some OpenSSL classes","Strongbox provides Public Key Encryption for ActiveRecord. By using a public key sensitive information can be encrypted and stored automatically. Once stored a password is required to access the information. dependencies are specified in standard Ruby syntax.","SymmetricEncryption supports encrypting ActiveRecord data, Mongoid data, passwords in configuration files, encrypting and decrypting of large files through streaming"],"Active Record Value Cleanup":["Attribute normalizer that excepts code blocks.","AutoStripAttributes helps to remove unnecessary whitespaces from ActiveRecord or ActiveModel attributes. It's good for removing accidental spaces from user inputs. It works by adding a before_validation hook to the record. It has option to set empty strings to nil or to remove extra spaces inside the string.","Work in progress, this will be a generic attribute sanitizer which can be used for sanitizing models and other objects holding data","Provides a framework for saving incoming blank values as nil in the database in instances where you'd rather use DB NULL than simply a blank string.","Normatron is a Ruby On Rails plugin that perform attribute normalizations for ActiveRecord objects. With it you can normalize attributes to the desired format before saving them in the database. This gem inhibits the work of having to override attributes or create a specific method to perform most of the normalizations.","A wrapper to make automatic sanitization of incoming data easier. Uses the sanitize gem and works in both plain Ruby and Rails projects.","Clean up your incoming ActiveRecord model attributes","StripAttributes automatically strips all ActiveRecord model attributes of leading and trailing whitespace before validation. If the attribute is blank, it strips the value to nil.","a small ActiveRecord plugin that removes ASCII control chars from attributes","Ruby (and Rails) attribute cleaning support, provides some nice and easy to enhance default normalization strategies."],"LDAP":["An extension of Authlogic to add LDAP authentication.","Devise extension to allow authentication via LDAP","","Net::LDAP for Ruby (also called net-ldap) implements client access for the Lightweight Directory Access Protocol (LDAP), an IETF standard protocol for accessing distributed directory services. Net::LDAP is written completely in Ruby with no external dependencies. It supports most LDAP client features and a subset of server features as well. Net::LDAP has been tested against modern popular LDAP servers including OpenLDAP and Active Directory. The current release is mostly compliant with earlier versions of the IETF LDAP RFCs (2251–2256, 2829–2830, 3377, and 3771). Our roadmap for Net::LDAP 1.0 is to gain full \u003Cem\u003Eclient\u003C/em\u003E compliance with the most recent LDAP RFCs (4510–4519, plus portions of 4520–4532).","A LDAP strategy for OmniAuth.","'Ruby/ActiveLdap' is a ruby extension library which provides a clean objected oriented interface to the Ruby/LDAP library. It was inspired by ActiveRecord. This is not nearly as clean or as flexible as ActiveRecord, but it is still trivial to define new objects and manipulate them with minimal difficulty.","Net::LDAP is an LDAP support library written in pure Ruby. It supports all LDAP client features, and a subset of server features as well.","Easy authentication to an LDAP server(s)","Treequel is an LDAP toolkit for Ruby. It is intended to allow quick, easy access to LDAP directories in a manner consistent with LDAP's hierarchical, free-form nature. It's inspired by and modeled after {Sequel}[http://sequel.rubyforge.org/], a kick-ass database library."],"System Provisioning":["AutomateIt is an open source tool for automating the setup and maintenance of servers, applications and their dependencies.","Test-driven sysadmin.","Boris: A networked-device scanning library. Boris allows you to write programs for logging into and pulling information off of various server platforms, appliances, and other types of networked devices, producing clean and consistent data ideal for configuration managment usage.","A systems integration framework, built to bring the benefits of configuration management to your entire infrastructure.","ESX Support for Chef's Knife Command","Sprinkles for Apache, Passenger, Memcached, Git, Mysql or Postgres","Puppet, an automated configuration management tool","Rudy: Not your grandparents' EC2 deployment tool.","Ruby DSL based software provisioning tool","See http://github.com/pitluga/supply_drop","Easy Ubuntu server setup via teleportation.","Vagrant is a tool for building and distributing virtualized development environments."],"Continuous Testing":["This is a stub gem to fix the confusion caused by autotest being part of the ZenTest suite.","Autotest relies on filesystem polling to detect modifications in source code files. This is expensive for the CPU, harddrive and battery - and unnecesary on Mac OS X 10.5 or higher which comes with the very efficient FSEvent core service for this very purpose. This gem teaches autotest how to use FSEvent.","This gem aims to improve support for Growl notifications by autotest.","Guard is a command line tool to easily handle events on file system modifications.","Guard::RSpec automatically run your specs (much like autotest).","Infinity Test is a continuous testing library and a flexible alternative to Autotest, using Watchr library with RSpec, Test::Unit or Bacon with RVM funcionality, giving the possibility to test with all Rubies that you have in your RVM configuration.","Allows you to fire specific command on file-system change.","Insert LiveReload into your app easily as Rack middleware","tconsole allows Rails developers to easily and quickly run their tests as a whole or in subsets. It forks the testing processes from a preloaded test environment to ensure that developers don't have to reload their entire Rails environment between test runs.","Runs your tests as they change, in parallel.","Modern continious testing (flexible alternative to autotest).","ZenTest provides 4 different tools: zentest, unit_diff, autotest, and multiruby. zentest scans your target and unit-test code and writes your missing code based on simple naming rules, enabling XP at a much quicker pace. zentest only works with Ruby and Minitest or Test::Unit. There is enough evidence to show that this is still proving useful to users, so it stays. unit_diff is a command-line filter to diff expected results from actual results and allow you to quickly see exactly what is wrong. Do note that minitest 2.2+ provides an enhanced assert_equal obviating the need for unit_diff autotest is a continous testing facility meant to be used during development. As soon as you save a file, autotest will run the corresponding dependent tests. multiruby runs anything you want on multiple versions of ruby. Great for compatibility checking! Use multiruby_setup to manage your installed versions."],"IRC Bots":["Autumn is a simple and modular irc framework","A simple, friendly DSL for creating IRC bots","Irc bot based on Cinch","em-irc is an IRC client that uses EventMachine to handle connections to servers","Gif slinging IRC bot","pure socket no framework :: IRC Qik Bot ~ its a babbling IRC Bot very quick to setup and act ;) aiming to be intelligent... Current Features: https://github.com/abhishekkr/irc-qik-bot/blob/master/README","Small DSL for writing IRC bots.","An IRC adapter for Lita.","Ponder (Stibbons) is a Domain Specific Language for writing IRC Bots using the EventMachine library.","A modular ruby IRC bot specifically designed for ease of extension via plugins.","A framework for creating IRC bots in Ruby. It's pretty rudimentary, but it's a start.","A Tiny IRC Bot framework"],"Daemonizing":["A Ruby daemon library that makes writing background daemons easy","A plugin for creating psuedo-scheduled jobs in Ruby on Rails.","Inspired by bundler and rack. Mostly built on top of Alexey Kovyrin's loops code. http://github.com/kovyrin/loops","daemon-kit aims to simplify creating Ruby daemons by providing a sound application skeleton (through a generator), task specific generators (jabber bot, etc) and robust environment management code.","Daemons provides an easy way to wrap existing ruby scripts (for example a self-written server) to be run as a daemon and to be controlled by simple start/stop/restart commands. You can also call blocks as daemons and control them from the parent or just daemonize the current process. Besides this basic functionality, daemons offers many advanced features like exception backtracing and logging (in case your ruby script crashes) and monitoring and automatic restarting of your processes if they crash.","daemonization support for Rails 3+","Turn any process into a demon.","A simpler way to create Ruby fallen angels, better known as daemons","Small daemon framework for ruby, with logging, error handler, scheduling and much more.","Looper is a module that your class can use to become a really, really simple daemon","Trivial module that allows you to create threads that are not killed if the process exits cleanly","Simple module that adds daemon functionality to a Ruby script.","Helps you creating and managing daemon threads with Ruby."],"JavaScript Tools":["Barista provides simple, integrated support for CoffeeScript in Rack and Rails applications. Much like Compass does for Sass, It also provides Frameworks (bundleable code which can be shared via Gems). Lastly, it also provides a Rack Application (which can be used to server compiled code), a around_filter-style precompiler (as Rack middleware) and simple helpers for rails and Haml. For more details, please see the the README file bundled with it.","Ruby CoffeeScript is a bridge to the JS CoffeeScript compiler.","Auto-magical scaffolding for Paul Irish's DOM-based Routing way of organizing your javascript.","A light wrapper for using dynamo.js with Ruby on Rails","JavaScript/CSS/HTML sources compiler","If you need to send some data to your js files and you don't want to do this with long way trough views and parsing - use this force!","Rack middleware that executes javascript before serving pages to crawlers.","Inspiredby HAML, SASS and JABL by mr Hampton Catlin","Build tools for JavaScript projects","Stupidly simple command line tool for squashing JS and CSS files. Used mostly for building UserJS","Resolve dependencies, merge and minify CSS and JavaScript files with Juicer - the command line tool for frontend engineers","Mousetrap is a javascript library for handling keyboard shortcuts in your web applications. This gem integrates Mousetrap with Rails asset pipeline for easy of use.","Ruby runtime and core library for javascript.","Rails bindings for opal JS engine","Ruby version of Dean Edwards' JavaScript compressor","Page-specific javascript for Rails done right","Auto-magical scaffolding for the Garber-Irish Implementation way of organizing your javascript.","jQuery CDN script tags and fallback in one neat package. Current version is for jQuery v2.1.0","A rake task to minify javascripts and coffeescripts","Sprockets is a Rack-based asset packaging system that concatenates and serves JavaScript, CoffeeScript, CSS, LESS, Sass, and SCSS.","Better Unobtrusive JavaScript Respond","Uglifier minifies JavaScript files by wrapping UglifyJS to be accessible in Ruby","Keep your vendor files up to date","Wiselinks makes following links and submitting some forms in your web application smarter and faster"],"Web App Frameworks":["REST enabled Rack powered web-micro-framework (holy buzzwords Batman!)","minature rails for stay-at-home moms","Cramp is a framework for developing asynchronous web applications.","Cuba is a microframework for web applications.","Scalable Framework aimed at Speed and Simplicity","Harbor Framework","The web app builder for Rails","Marley is a framework for quickly building RESTful web services and applications. Development is fast for two reasons: Marley implements lots of sensible defaults, all of which can be overridden and most of which can be overridden easily. And Marley servers exchange only data and metadata with clients.","Merb. Pocket rocket web framework.","The Godfather of Sinatra provides a full-stack agnostic framework on top of Sinatra","Pakyow is an open-source framework for building apps that embrace the web and encourages a development process that's friendly to both designers and developers. It's built for getting along.","Rack provides a minimal, modular and adaptable interface for developing web applications in Ruby. By wrapping HTTP requests and responses in the simplest way possible, it unifies and distills the API for web servers, web frameworks, and software in between (the so-called middleware) into a single method call. Also see http://rack.github.com/.","Ramaze is a simple and modular web framework","Rango is ultralightweight, ultracustomizable, ultracool web framework deeply inspired by Django.","Nothing to see yet.","The super-friendly web framework.","Ruby on Rails is a full-stack web framework optimized for programmer happiness and sustainable productivity. It encourages beautiful code by favoring convention over configuration.","Is web framework that makes common things simple, and uncommon things possible.","A light-weight Sinatra-inspired web framework for web sites and applications of any size.","Sinatra is a DSL for quickly creating web applications in Ruby with minimal effort.","Strelka is a framework for creating and deploying Mongrel2[http://mongrel2.org/] web applications in Ruby. It's named after a lesser known {Russian cosmonaut}[http://en.wikipedia.org/wiki/Strelka_(dog)#Belka_and_Strelka] who was one of the first canine space travelers to orbit the Earth and return alive. Her name means \"little arrow\".","A bliki-type web content thing."],"Gem Doc Viewers":["Bdoc is a simple replacement for the gem or yard server. All it does is look at all of the Gems you have installed locally and creates a nice iframe based browser that makes it easy to navigate between gem docs. IT DOES NOT REQUIRE A SERVER FOR VIEWING... not like gem server does! If you use this, I highly suggest also using Hanna[http://github.com/mislav/hanna/tree/master] (a beautiful rdoc theme). Check out the demo http://manalang.github.com/bdoc/bdoc.html","Wiki interface allowing people to contribute to the documentation of a project","A sinatra based interface for browsing and admiring your gems.","A complete reimplementation of the gem server command as a Sinatra application"],"Benchmarking":["Benchmarkable allows monitoring the performance of instance methods and reporting those in csv format","Sharable benchmarks","Statistically correct benchmarking for Ruby.","A panel that appears in the browser to provide stats on page load times and other debugging information for Rails 3","MethodProfiler observes your code and generates reports about the methods that were run and how long they took.","Library for generating nice ruby-benchmarks","Simple benchmarking with noticable progress and pretty results."],"Dependency Management":["Manages a Cookbook's, or an Application's, Cookbook dependencies","drop in replacement for bundler","A simple tool for tracking vendor branches in git.","Bundler for non-ruby dependencies from homebrew","Bundler manages an application's dependencies through its entire life, across many machines, systematically and repeatably","Symlink to external dependencies, rather than bloating your repositories with them","CheckZilla is a command line tool allowing you to check and be notified of outdated software.","Quickly freeze and unfreeze external git dependencies","Add the latest version of a gem to your Gemfile from the command line.","","Giternal provides dead-simple management of external git dependencies. It only stores a small bit of metadata, letting you actively develop in any of the repos. Come deploy time, you can easily freeze freeze all the dependencies to particular versions","Isolate is a very simple RubyGems sandbox. It provides a way to express and automatically install your project's Gem dependencies.","A Framework for Bundlers.","Use Ruby gems and mock require statements within RubyMotion applications","Piston makes it easy to merge vendor branches into your own repository, without worrying about which revisions were grabbed or not. Piston will also keep your local changes in addition to the remote changes."],"Logging":["Hybrid action logging, consisting of standard and custom logging.","This is an experiment to try and make logging more flexible and more consumable. Plain text logs are bullshit, let's emit structured and contextual logs. Metrics, too!","\\Clogger is Rack middleware for logging HTTP requests. The log format is customizable so you can specify exactly which fields to log.","Fluentd is an event collector system. It is a generalized version of syslogd, which handles JSON objects for its log messages","Library to send GELF messages to Graylog2 logging server. Supports plain-text, GELF messages and exceptions.","Logging library that provides the ability to add class/module specific filters","Log outgoing HTTP requests made from your application. Helpful for tracking API calls of third party gems that don't provide their own log output.","See also: http://logging.apache.org/log4j","Logging is a flexible logging library for use in Ruby programs based on the design of Java's log4j library. It features a hierarchical logging system, custom level names, multiple output destinations per log event, custom formatting, and more.","Wraps logging in a nice and convenient way making it easy to apply on any project","Tame Rails' multi-line logging into a single line per request","Lumber tries to make it easy to use the more robust log4r logging system within your rails application. To do this it sets up log4r configuration from a yml file, and provides utility methods for adding a :logger accessor to classes dynamicaly as they get created.","MongoDB logger for Rails","Captures raketask output along with additional information (task name, duration, start time, error) for further usage.","A Rails engine which receives logs and provides an interface for them","Yell - Your Extensible Logging Library. Define multiple adapters, various log level combinations or message formatting options like you've never done before"],"Rails In-Place Editing":["BestInPlace is a jQuery script and a Rails 3 helper that provide the method best_in_place to display any object field easily editable for the user by just clicking on it. It supports input data, text data, boolean data and custom dropdown data. It works with RESTful controllers.","Forked from the rails-3.0 branch of best_in_place, this includes a couple of key enhancements for Rails 3.0.x users","BestInPlaceMongoid is a fork of BestInPlace jQuery script and a Rails 3 helper that provide the method best_in_place to display any object field easily editable for the user by just clicking on it. It supports input data, text data, boolean data and custom dropdown data. It works with RESTful controllers.","Easy editing in place for RESTful web apps.","Restful inplace plugin for Rails","InPlaceEditing plugin","","in_place_rich_editing plugin supporting tinymce adapted from rails in_place_editing plugin and http://inplacericheditor.box.re/usage","An edit-in-place gem that uses the JEditable jQuery plugin to post updates to the server via AJAX.","jQuery based in-place editor generated by Formtastic","An unobtrusive, highly configurable in place editor using jQuery and Rails.","Edit in place plugin for jRails.","Unobtrusive in place editing, using jEditable; only works in Rails 3","A RESTful Inplace-Editor","This plugin is meant as a drop-in replacement for the current inplace_edit_for plugin."],"App Instrumentation":["Provides a better error page for Rails and other Rack apps. Includes source code inspection, a live REPL and local/instance variable inspection for all stack frames.","help to kill N+1 queries and unused eager loading.","This framework lets you build \u0026 easily layout dashboards with your own custom widgets. Use it to make a status boards for your ops team, or use it to track signups, conversion rates, or whatever else metrics you'd like to see in one spot. Included with the framework are ready-made widgets for you to use or customize. All of this code was extracted out of a project at Shopify that displays dashboards on TVs around the office.","The exceptionally handsome dashboard framework for Rails.","FnordMetric is a Ruby Event-Tracking gem on steroids","Gem to make statistics sending from Ruby applications simple and efficient as possible. Currently supports Statsd, and is inspired by the original ruby-statsd gem by Etsy.","Gem to make statistics sending from Rails applications simple and efficient as possible","Collect high level application performance metrics and forward them for analysis","A gem for collecting Rails application metrics. No server or 3rd party services required.","Request your request","An experimental metrics client.","Server for handling metrics from metriks","New Relic is a performance management system, developed by New Relic, Inc (http://www.newrelic.com). New Relic provides you with deep information about the performance of your web application as it runs in production. The New Relic Ruby Agent is dual-purposed as a either a Gem or plugin, hosted on http://github.com/newrelic/rpm/","Take a peek into your Rails application.","With query_trace enabled, the Rails logs will contain a partial stack trace for every executed SQL statement, making it easier to find where they are generated in your code.","Observe your web applications in the wild! == DESCRIPTION","Debugging toolbar for Rack applications implemented as middleware","Debugging toolbar for Rack applications implemented as middleware. Based on logical-insight and rack-bug.","Every Rails page has footnotes that gives information about your application and links back to your editor.","Middleware to show instrumentation information in http headers","Metrics measurement for your app on top of ActiveSupport::Notifications","The Rails View Annotator makes it easy to find out which partial generated which output","Plugins for the Scout Server Monitoring and Reporting Tool","Surface slow code paths in your Rails 3 app via Growl / libnotify","System Metrics is a Rails 3 Engine that provides a clean web interface to the performance metrics instrumented with ActiveSupport::Notifications"],"Acceptance Test Frameworks":["Test WPF UI apps with IronRuby","Behaviour Driven Development derived from Cucumber but as an internal DSL with methods for reuse","Behaviour Driven Development with elegance and joy","Extension for Test::Unit to have a Steak-like DSL for acceptance testing","Test code samples embedded in files like readmes","Cucumber scenarios are long and confusing sometimes. Release yourself from the tyranny of client-centered specing!","Spinach is a BDD framework on top of gherkin","Steak is a minimal extension of RSpec-Rails that adds several conveniences to do acceptance testing of Rails applications using Capybara. It's an alternative to Cucumber in plain Ruby.","Define realistic testplans and run them against your webapps","Write Stories and User Acceptance Tests using Contest, the tiny add on to Test::Unit that provides nested contexts and declarative tests.","Provides the ability to define steps and run Gherkin files from with RSpec","You got Cucumber in my RSpec!"],"Continuous Integration":["Continuous Integration software written on top of Ruby on Rails 3 and DelayedJob.","Super simple capistrano deployment notifications.","Cerberus is a Continuous Integration software for Ruby projects. CI helps you keep your project in a good shape. Cerberus could be easily invoked from Cron (for Unix) or nnCron (for Windows) utilities.","A console utility to get information from your ThoughtWorks' Go Continuous Integration Server. Run '$ ci-go-nfo setup' to configure your access from console utility.","cijoe is a sinatra-based continuous integration server. It's like an old rusty pickup truck: it might be smelly and gross, but it gets the job done.","CruiseControl for Ruby. Keep it simple.","CI server with support for pipelines","Your Friendly Continuous Integration server. Easy, fun and painless!","A suite of utilities for bringing continous integration to your projects (not the other way around) with jenkins CI","An integration server written in Rails and integrated with metric_fu, rspec, cucumber and maven. Easy to install and easy to use","tddium runs your test suite simply and quickly in our managed cloud environment. You can run tests by hand, or enable our hosted CI to watch your git repos automatically. Tddium automatically and safely parallelizes your tests to save you time, and takes care of setting up fresh isolated DB instances for each test thread. Tests have access to a wide variety of databases (postgres, mongo, redis, mysql, memcache), solr, sphinx, selenium/webdriver browsers, webkit and culerity. Tddium supports all common Ruby test frameworks, including rspec, cucumber, test::unit, and spinach. Tddium also supports Javascript testing using jasmine, evergreen, and many other frameworks.","A distributed build system for the open source community.","Updates pull requests on github, with latest build from Jenkins and QA status"],"Deployment Automation":["painless git push deployments for everyone","Capistrano is a utility and framework for executing commands in parallel on multiple remote machines, via SSH.","Incremental Git repository deployment","See http://jeroenr.github.com/debloy/","This project provides libraries of Capistrano tasks and extensions to remove the repetative manual work associated with installing services on linux servers.","Simple web application deployment with \"git push\"","A tool to install useful git hooks on your remote repository to enable push-based, Heroku-like deployment on your host.","Gofer provides a flexible and reliable model for performing tasks on remote server using Net::SSH","Very simple deployment tool. It was made to deploy rails applications using github, bundler.","Client library and command-line tool to deploy and manage apps on Heroku.","Manage multiple Heroku instances/apps for a single Rails app using Rake. It's the Capistrano for Heroku, without the suck.","Manage multiple Heroku instances/apps for a single Rails app using Rake","Rails and Sinatra deployment made easy","Retrieve cloud instance DNS names from metadata search","Really fast deployer and server automation tool.","Simple Rails deployment and configuration management. 15 minute deploys of Rails 2, 3, or 4 apps.","[\"Negroku is an opinionated collection of recipes for capistrano, blended with a handy CLI\"]","Library to create task for deployment to Heroku","Passenger-based Heroku-like Deployment","Manage your Capistrano deployments with ease","The rubber plugin enables relatively complex multi-instance deployments of RubyOnRails applications to Amazon's Elastic Compute Cloud (EC2). Like capistrano, rubber is role based, so you can define a set of configuration files for a role and then assign that role to as many concrete instances as needed. One can also assign multiple roles to a single instance. This lets one start out with a single ec2 instance (belonging to all roles), and add new instances into the mix as needed to scale specific facets of your deployment, e.g. adding in instances that serve only as an 'app' role to handle increased app server load.","If you want to manage several Rack apps using different versions of Ruby via RVM, Ruploy can help you. It handles gemsets too !","Tool for managing applications and clouds at shellycloud.com","A collection of useful utilities for Capistrano deployments","A continous deploy pipeline.","Vlad the Deployer is pragmatic application deployment automation, without mercy. Much like Capistrano, but with 1/10th the complexity. Vlad integrates seamlessly with Rake, and uses familiar and standard tools like ssh and rsync. Impale your application on the heartless spike of the Deployer.","Opinionated gem for doing fast git-based server deployments."],"Blog Engines":["Add a blog to your Rails application in minutes with this mountable Rails Engine","Because Blogojevich would be too tough to remember. It's a pluggable blogging system for Rails 3.","Octopress is an obsessively designed framework for Jekyll blogging. It’s easy to configure and easy to deploy. Sweet huh?","Since Typo has been in existence since March 2005, it is likely the oldest blogging platform in Rails. It has a full set of features you would expect from such an engine, which include powerful SEO capabilities, full themes, and plug-in extensions.","A really straightforward open source Ruby on Rails blog engine designed for integration with Refinery CMS.","Serious is a simple, file-driven blog engine inspired by toto and driven by sinatra with an emphasis on easy setup","the tiniest blog-engine in Oz."],"Markup processors":["BlueCloth is a Ruby implementation of John Gruber's Markdown[http://daringfireball.net/projects/markdown/], a text-to-HTML conversion tool for web writers. To quote from the project page: Markdown allows you to write using an easy-to-read, easy-to-write plain text format, then convert it to structurally valid XHTML (or HTML). It borrows a naming convention and several helpings of interface from {Redcloth}[http://redcloth.org/], Why the Lucky Stiff's processor for a similar text-to-HTML conversion syntax called Textile[http://www.textism.com/tools/textile/]. BlueCloth 2 is a complete rewrite using David Parsons' Discount[http://www.pell.portland.or.us/~orc/Code/discount/] library, a C implementation of Markdown. I rewrote it using the extension for speed and accuracy; the original BlueCloth was a straight port from the Perl version that I wrote in a few days for my own use just to avoid having to shell out to Markdown.pl, and it was quite buggy and slow. I apologize to all the good people that sent me patches for it that were never released. Note that the new gem is called 'bluecloth' and the old one 'BlueCloth'. If you have both installed, you can ensure you're loading the new one with the 'gem' directive: \t# Load the 2.0 version \tgem 'bluecloth', '\u003E= 2.0.0' \t \t# Load the 1.0 version \tgem 'BlueCloth' \trequire 'bluecloth'","Creole is a lightweight markup language (http://wikicreole.org/).","kramdown is yet-another-markdown-parser but fast, pure Ruby, using a strict syntax definition and supporting several common extensions.","Small command line tool that reads Markdown files and outputs HTML","Maruku is a Markdown interpreter in Ruby. \tIt features native export to HTML and PDF (via Latex). The \toutput is really beautiful!","McBean can convert documents from one format to another. McBean currently supports: * HTML * Markdown (a subset) * Textile (a subset) * Creole (a subset) with the help of Loofah, Nokogiri, RDiscount, RedCloth and Creole. \"You can't teach a Sneetch.\" -- Sylvester McMonkey McBean","multi_markdown allows projects to use a wide variety of Markdown libraries, without having to depend on a specific one.","Ruby wrapper for Pandoc","Fast Implementation of Gruber's Markdown in C","A fast, safe and extensible Markdown to (X)HTML parser","Textile parser for Ruby.","Fast Markdown implementation","A stupid formatter for piping text through markup processors with a unified API","A fast, safe and extensible Markdown to (X)HTML parser"],"Rails Fixture Replacement":["The ultimate DRY and fast solution to loading test data in Ruby and Rails.","DataMapper plugin for building pseudo random models","Fabrication is an object generation framework for ActiveRecord, Mongoid, DataMapper, Sequel, or any other Ruby object.","factory_girl provides a framework and DSL for defining and using factories - less error-prone, more explicit, and all-around easier to work with than fixtures.","Object creation methods everyone already has","FixtureBuilder allows testers to use their existing factories, like FactoryGirl, to generate high performance fixtures that can be shared across all your tests","FixtureReplacement is a Rails plugin that provides a simple way to quickly populate your test database with model objects without having to manage multiple, brittle fixture files. You can easily set up complex object graphs (with models which reference other models) and add new objects on the fly.","Fixtures aren't fun. Machinist is.","Test::Unit begot MiniTest; factory_girl begets Miniskirt.","Fixture killer","Create repeatable seed fixtures that you can continually use and deploy to multiple environments and tenants.","Lightweight flexible factories for Ruby and Rails testing.","Spawn is a very small library (just 14 lines of code) that can effectively replace fixtures or any other library for the same task.","Transactionata: Transactional dynamic test data for Rails Tests. Set up your models and factories in a block that will be executed once and then rolled back by hooking into ActiveRecord's built-in fixture transactions"],"JavaScript Testing":["Framework for  JavaScript Testing (currently a Rails Plugin)","Run Jasmine JavaScript unit tests, integrate them into Ruby applications.","Full support for the Rails 3.1 asset pipeline when testing your coffeescript or javascript files using Gerbil","Automated jQuery tests with QUnit","Test your JavaScript without any framework dependencies, in any environment, and with a nice descriptive syntax.","Javascript Coverage Tool","Konacha is a Rails engine that allows you to test your JavaScript with the mocha test framework and chai assertion library. It is similar to Jasmine and Evergreen, but does not attempt to be framework agnostic. By sticking with Rails, Konacha can take full advantage of features such as the asset pipeline and engines.","Opal compatible spec library","JavaScript unit tests.","The Screw Unit server conveniently serves your Screw Unit specs and javascript files and css stylesheets.","The Screw Unit server conveniently serves your Screw Unit specs and javascript files and css stylesheets.","Distributed continuous integration testing for JavaScript.","A nice little library for writing and implementing web application behavior in javascript that looks like English."],"Mocking":["Decreases the need to write integration tests by ensuring that the things you stub or mock actually exist.","Simple cross process stubbing","A mocking library in the spirit of the Bacon spec library. Small, compact, and works with Bacon.","FlexMock is a extremely simple mock object class compatible with the Test::Unit framework. Although the FlexMock's interface is simple, it is very flexible.","Mocking and stubbing library with JMock/SchMock syntax, which allows mocking and stubbing of methods on real (non-mock) classes.","Instantiate one with `redis = MockRedis.new` and treat it like you would a normal Redis object. It supports all the usual Redis operations.","A simple stub \u0026 mock library.","RR is a test double framework that features a rich selection of double techniques and a terse syntax.","RSpec's 'test double' framework, with support for stubbing and mocking","A fast, tiny (82 lines) hybrid mocking library that supports classical and partial mocking. Partial mocking mixes classical mocking with real objects. There's no monkey patching `Object` or copying. Mock objects are isolated leaving real objects completely untainted.","A simple modern mocking library that uses the spy pattern and checks method's existence and arity.","Stubbing and mocking that doesn't hurt or suck.  WIN.","Framework to aid in handrolling mock/spy objects.","Contract tests for rspec"],"Gem Creation":["Mr Bones is a handy tool that creates new Ruby projects from a code skeleton. The skeleton contains some starter code and a collection of rake tasks to ease the management and deployment of your source code. Several Mr Bones plugins are available for creating git repositories, creating GitHub projects, running various test suites and source code analysis tools.","A Rubygems packaging tool that provides Rake tasks for documentation, extension compiling, testing, and deployment.","Creates a Rails 3 engine with Rakefile, Gemfile and running tests","This library contains some useful functionality to support the development of Ruby Gems","RubyGems plugin to generate a new gem skeleton based on customizable templates.","Release your ruby gems with ease. (What a bold statement for such a tiny plugin ...)","Hoe is a rake/rubygems helper for project Rakefiles. It helps you manage, maintain, and release your project and includes a dynamic plug-in system allowing for easy extensibility. Hoe ships with plug-ins for all your usual project tasks including rdoc generation, testing, packaging, deployment, and announcement.. See class rdoc for help. Hint: `ri Hoe` or any of the plugins listed below. For extra goodness, see: http://seattlerb.rubyforge.org/hoe/Hoe.pdf","Inochi is an infrastructure that gives life to open-source [Ruby] projects\r and helps you document, test, package, publish, announce, and maintain them.","Simple and opinionated helper for creating Rubygem projects on GitHub","Quickly bundle any Ruby libraries into a RubyGem and share it with the world, your colleagues, or perhaps just with yourself amongst your projects. RubyGems are centrally stored, versioned, and support dependencies between other gems, so they are the ultimate way to bundle libraries, executables, associated tests, examples, and more. Within this gem, you get one thing - \u003Ccode\u003Enewgem\u003C/code\u003E - an executable to create your own gems. Your new gems will include designated folders for Ruby code, test files, executables, and even a default website page for you to explain your project, and which instantly uploads to RubyForge website (which looks just like this one by default)","Ore is a flexible Ruby project generator. Unlike other Ruby project generators, Ore provides many builtin templates and allows custom templates to be installed from Git repositories.","A project helper, include create, develop, test, release helper.","Simple Rake tasks that make life easier.","Agnostic and unobtrusive Rake tasks for managing and releasing Ruby Gems.","Make gems. Simple."],"Rails DB Bootstrapping":["A Rails plugin to assist in bootstrapping and seeding your database.","Manage seed data for Rails projects","Packages up code needed to pull data from YAML files when seeding, and adds a process log.","has_alter_ego makes it possible to keep seed and live data transparently in parallel. In contrast to other seed data approaches has_alter_ego synchronizes the seed definitions with your database objects automagically unless you've overridden it in the database.","Mass populate an Active Record database.","Extends Rails seeds to split out complex seeds into multiple files and lets each environment have it's own seeds.","Create seed files for each model from your database data.","Seed Fu is an attempt to once and for all solve the problem of inserting and maintaining seed data in a database. It uses a variety of techniques gathered from various places around the web and combines them to create what is hopefully the most robust seed data system around."],"Scripting Frameworks":["Boson is a modular command/task framework. Thanks to its rich set of plugins, it differentiates itself from rake and thor by being usable from irb and the commandline, having optional automated views generated by hirb and allowing libraries to be written as plain ruby. Works with ruby \u003E= 1.9.2","Command line utility framework","a class factory and dsl for generating command line programs real quick","Rake is a Make-like program implemented in Ruby. Tasks and dependencies arespecified in standard Ruby syntax.","Sake tastes great and helps maintain system-level Rake files.","A scripting framework that replaces rake, sake and rubigen"],"Project Management":["An agile user story tracker that generates gherkin files and step definitions for use with the cucumber testing framework.","ChiliProject is a web based project management system built on Ruby on Rails","An agile project planning tool","Project management and code hosting  application. Follow us on twitter @gitlabhq","Compute the estimated time spent by developers working on code within a GIT repository. Useful for verifying developer time sheets and for tax purposes. See https://github.com/rietta/git_time_extractor/wiki.","A bugtracker in Rails/MongoMapper","Synchronize between Cucumber and Pivotal Tracker","Redmine is a flexible project management web application written using Ruby on Rails framework.  http://github.com/edavis10/redmine is the official git mirror of the svn repository","Open source rails scrum tool","Open source, web-based agile project management, featuring: Goal planner, Story management, Issue-tracker, Code review, SCM Integration, Wiki \u0026 Blog.  It is intended to assist the collaborative aspect of work carried out by software development teams.","Open source task and project management in ruby on rails","This is the legacy version of Teambox - the award-winning collaboration solution, inspired by Basecamp, Yammer and Twitter."],"Calendars":["A simple helper for creating an HTML calendar. The \"calendar\" method will be automatically available to your Rails view templates, or can be used with Sinatra or other webapps. There is also a Rails generator that copies some stylesheets for use alone or alongside existing stylesheets.","simple calendar gem, including helpers to display objects inside cells","Calendar with event that uses many models","Generates HTML event calendars","A view helper that creates a calendar using a table. You can easily add events with any content.","Implements the iCalendar specification (RFC-2445) in Ruby. This allows for the generation and parsing of .ics files, which are used by a variety of calendaring applications.","LaterDude is a small calendar helper plugin for Rails with i18n support.","A new Ruby implementation of RFC2445 iCalendar. The existing Ruby iCalendar libraries (e.g. icalendar, vpim) provide for parsing and generating icalendar files, but do not support important things like enumerating occurrences of repeating events. This is a clean-slate implementation of RFC2445. A Google group for discussion of this library has been set up http://groups.google.com/group/rical_gem","Selene is an iCalendar parser for Ruby","A Rails view helper for creating weekly calendars (horizontal scrolling), inspired by TableBuilder."],"Code Metrics":["Fails your build if code quality thresholds are not met","\"Code coverage tool for ruby 1.9.2 to 2.1. Use it by \"require 'coco'\" from rspec or unit/test. It display names of uncovered files on console. It builds simple html report. It reports sources that have no tests. It's configurable with a simple yaml file.","\"This is a port of the rails 'rake stats' method so it can be made more robust and work for non rails projects. New features may eventually be added as well.\"","Language-agnostic Code Statistics","A Ruby implementation of the Coveralls API.","CoverMe - Code Coverage for Ruby 1.9","Computes the CRAP metric for Ruby source code","Flay analyzes code for structural similarities. Differences in literal values, variable, class, method names, whitespace, programming style, braces vs do/end, etc are all ignored. Making this totally rad.","Flog reports the most tortured code in an easy to read pain report. The higher the score, the more pain the code is in.","Lint tool for Opscode Chef cookbooks.","Guard::Rubocop automatically checks Ruby code style with RuboCop when files are modified.","JSLint JavaScript checker wrapped in a Ruby gem for easier use","Calculates ABC metric for Ruby 1.9. Just like Flog but much more dull.","Code metrics from Flog, Flay, Saikuro, Churn, Reek, Roodi, Code Statistics, and Rails Best Practices. (and optionally RCov)","Keep bad code out of your projects. Your idea of bad code, no one elses. Outlaw defines an example based DSL for demonstrating anti-patterns and builds a rule for each anti-pattern that it alerts the user to violations when encountered in a project's codebase during scanning. Outlaw is a work in progress and contributions, suggestions and forks are welcome. Outlaw was a personal project for Mendicant University, Session 10 in Jan '12","Static analysis Lint-type tool to improve your OO Ruby code","a code metric tool for rails codes, written in Ruby.","rcov is a code coverage tool for Ruby.","rcov_plugin adds the rake tasks that you need to measure coverage in your Rails project","Reek is a tool that examines Ruby classes, modules and methods and reports any code smells it finds.","metrics and CI are for A students.","Roodi parses your Ruby code and warns you about design issues you have based on the checks that is has configured","Automatic Ruby code style checking tool. Aims to enforce the community-driven Ruby Style Guide.","Saikuro is a Ruby cyclomatic complexity analyzer. When given Ruby source code Saikuro will generate a report listing the cyclomatic complexity of each method found. In addition, Saikuro counts the number of lines per method and can generate a listing of the number of tokens on each line of code.","Code coverage for Ruby 1.9+ with a powerful configuration library and automatic merging of coverage across test suites","tailor parses Ruby files and measures them with some style and static analysis \"rulers\". Default values for the Rulers are based on a number of style guides in the Ruby community as well as what seems to be common. More on this here http://wiki.github.com/turboladen/tailor. tailor's goal is to help you be consistent with your code, throughout your project, whatever style that may be."],"Active Record Named Scopes":["Build common named scopes automatically, and provide a simple way to merge them with a single #search call.","Filterrific is a Rails Engine plugin that makes it easy to add filtering, searching, and sorting to your ActiveRecord lists.","Generated scopes for ActiveRecord classes.","Quick named scopes to make your life a little easier","Returns a random record for Ruby Models using ActiveRecord","Adds the ability to pull random records from ActiveRecord","Ransack is the successor to the MetaSearch gem. It improves and expands upon MetaSearch's functionality, but does not have a 100%-compatible API.","Build up named scopes conditionally.","Searchlogic makes using ActiveRecord named scopes easier and less repetitive.","Small DSL to create ActiveRecord (\u003E= 3.1) attribute predicates without writing SQL.","Collection of named_scopes making ActiveRecord SQL easier","A collection of utilitarian named scopes providing common functionality for ActiveRecord models."],"Online Shops":["A really simple shopping cart implementation for rails.","This is a framework for generating and displaying invoices (ideal for commercial Rails apps). It allows for flexible business logic; provides tools for tax handling, commission calculation etc. It aims to be both developer-friendly and accountant-friendly. The Ruby Invoicing Framework is based on {ActiveRecord}[http://api.rubyonrails.org/classes/ActiveRecord/Base.html]. Please see {the website}[http://ept.github.com/invoicing/] for an introduction to using Invoicing, and check the {API reference}[http://invoicing.rubyforge.org/doc/] for in-depth details.","nimbleShop is a free and open source e-commerce framework based on ruby on rails","Radiant Shop is an attempt at a simple but complete store. It includes Products, Categories, Orders and Credit Card Payments","Ruby on Rails Ecommerce platform, perfect for your small business solution.","Easily use FedEx, UPS, USPS web services with an elegant and simple syntax.","Spree is an open source e-commerce framework for Ruby on Rails. Join us on the spree-user google group or in #spree on IRC"],"CSV Parsers":["Ruby CSV parser gem, written in pure C.","Bend CSVs to your will with declarative schemas.","http://github.com/sparkboxx/csv_importer Ever needed to import csv files where every row needs to be converted into a model? The CSV importer turns every row of a CSV file into an object. Each column is matched and tested against a given class. You can provide a dictionary with translations between the CSV column names and the object properties.","CsvPirate is the easy way to create a CSV of essentially anything in Ruby, in full pirate regalia. It works better if you are wearing a tricorne!","FasterCSV is intended as a complete replacement to the CSV standard library. It is significantly faster and smaller while still being pure Ruby code. It also strives for a better interface.","CSV parsing awesomeness","Turns csv files into hashes without reading the entire csv into memory","Now you can use the super fast COPY for import/export data directly from your AR models.","Yet another CSV parser with CSV header validation, based on CCSV (http://github.com/fauna/ccsv/).","Provides a simple dsl for creating csv import tasks.","Ruby Gem for smarter importing of CSV Files as Array(s) of Hashes, with optional features for processing large files in parallel, embedded comments, unusual field- and record-separators, flexible mapping of CSV-headers to Hash-keys","Tabular is a Ruby library for reading, writing, and manipulating CSV, tab-delimited and Excel data."],"Concurrent Processing":["Celluloid enables people to build concurrent programs out of concurrent objects just as easily as they build sequential programs out of sequential objects","Cool.io provides a high performance event framework for Ruby which uses the libev C library","Dataflow concurrency for Ruby (inspired by the Oz language)","EventMachine implements a fast, single-threaded engine for arbitrary network communications. It's extremely easy to use in Ruby. EventMachine wraps all interactions with IP sockets, allowing programs to concentrate on the implementation of network protocols. It can be used to create both network servers and clients. To create a server or client, a Ruby program only needs to specify the IP address and port, and provide a Module that implements the communications protocol. Implementations of several standard network protocols are provided with the package, primarily to serve as examples. The real goal of EventMachine is to enable programs to easily interface with other programs using TCP/IP, especially if custom protocols are required.","Tribe is a Ruby gem that implements event-driven actors.","A lightweight, extensible asynchronous event routing framework in Ruby. Patch your objects together with wires. Inspired by the python 'circuits' framework.","Workers is a Ruby gem for performing work in background threads."],"Log Analysis":["Centralized logging for rails apps using MongoDB. The idea and the core code is from http://github.com/peburrows/central_logger","","Indy is a log archelogy library that treats logs like data structures. Search fixed format or custom logs by field and/or time.","this is gem is useful to check the log file data in browser","logstash - logs/event transport, processing, management, search.","A tail(1)-like utility for nginx log files. It supports parsing, filtering and formatting individual log lines.","Request log analyzer's purpose is to find out how your web application is being used, how it performs and to focus your optimization efforts. This tool will parse all requests in the application's log file and aggregate the information. Once it is finished parsing the log file(s), it will show the requests that take op most server time using various metrics. It can also insert all parsed request information into a database so you can roll your own analysis. It supports Rails-, Merb- and Rack-based applications logs, Apache and Amazon S3 access logs and MySQL slow query logs out of the box, but file formats of other applications can easily be supported by supplying an easy to write log file format definition."],"Rails Activity Feeds":["Subscribe to and build activity feeds for your models, for example followings and friendships","Help you implement feeds / timeline / public activity in rails application.","A rails plugin that allows you to create extensible log of activity","Easy activity tracking for your ActiveRecord models. Provides Activity model with details about actions performed by your users, like adding comments, responding etc.","Streama is a simple activity stream gem for use with the Mongoid ODM framework","Easily build timelines, much like GitHub's news feed","This gem creates a scope for unread objects and adds methods to mark objects as read"],"Graphing":["Create beautiful Javascript charts with one line of Ruby","GChart exposes the Google Chart API via a friendly Ruby interface. It can generate the URL for a given chart (for webpage use), or download the generated PNG (for offline use).","Visit http://code.google.com/p/gchartrb to track development regarding gchartrb. == FEATURES: * Provides an object oriented interface in Ruby to create Google Chart URLs for charts. == INSTALL: === Ruby Gem:","Generate charts using Google API \u0026 Ruby","Google Charts with Ruby","This Ruby gem, GoogleVisualr, is a wrapper around the Google Chart Tools that allows anyone to create the same beautiful charts with just Ruby; you don't have to write any JavaScript at all.","Graphite API - A Simple ruby client, aggregator daemon and API tools","Beautiful graphs for one or multiple datasets. Can be used on websites or in documents.","Gem that includes Highcharts (Interactive JavaScript charts for your web projects), in the Rails Asset Pipeline introduced in Rails 3.1","rails plugin for make highcharts a la ruby , works in rails 3.0 / 3.X","This library was ported from the open flash chart project's php code to be used with Ruby on Rails.","The ruby on rails plugin for teethgrinder's Open Flash Chart (version 2)","Ruby port of the slick pChart charting library","Fire-and-forget data collection and graphing service","The ruby gnuplot gem [gnuplot] [rgnuplot] (official releases of the gnuplot gem are from rdp branch)","Ruby port of Protovis[http://vis.stanford.edu/protovis/], a Javascript visualization toolkit.","Scruffy is a Ruby library for generating high quality, good looking graphs. It is designed to be easy to use and highly customizable.","Seer is a lightweight, semantically rich wrapper for the Google Visualization API. It allows you to easily create a visualization of data in a variety of formats, including area charts, bar charts, column charts, gauges, line charts, and pie charts.","Tiny graphs.","Purpose of this gem is to create neat, simple, technical graphs. This is alternative to most new libraries which create small, candy graphs using JavaScript.","a jQuery plugin that makes pretty bar charts"],"Random Data Generation":["**CheapRandom** is a set of tools for pseudo random number generation from arbitrary data. The properties of the **CheapRandom seed** make convenient random number generation possible -- useful for easily repeatable software testing. The **CheapRandom algorithm** is information conserving and generally appears to produce lower chi-squared statistics than **Kernel::rand** i.e. it appears to be more random. The **CheapRandom algorithm**, an original work by Bardi Einarsson, has been in use for 6 years.","Data anonymization tool for RDBMS databases","Faker, a port of Data::Faker from Perl, is used to easily generate fake data: names, addresses, phone numbers, etc.","Faster Faker, generates dummy data.","Easy and customizable generation of forged data. Can be used as a gem or a rails plugin. Includes rails generators for creating your own forgeries.","Library for generating random strings from regular expressions.","Random data generator"],"Game libraries":["OpenGL accelerated 2D game framework for Ruby. Builds on Gosu (Ruby/C++) which provides all the core functionality. Chingu adds simple yet powerful game states, prettier input handling, deployment safe asset-handling, a basic re-usable game object and stackable game logic.","Enhanced ruby bindings for the chipmunk 5.3.4 game physics engine.","Fidgit is a GUI library built on Gosu/Chingu","A simple framework that aims to improve your Gosu experience.","Framework for building and distributing games using Gosu","Gioco is a easy to implement gamification gem based on plug and play concept. Doesn't matter if you already have a full and functional database, Gioco will smoothly integrate everything and provide all methods that you might need.","2D game development library. Gosu features easy to use and game-friendly interfaces to 2D graphics and text (accelerated by 3D hardware), sound samples and music as well as keyboard, mouse and gamepad/joystick input. Also includes demos for integration with RMagick, Chipmunk and OpenGL.","Gosu-Android is an implementation for Android devices of the multiplatform Gosu library.","Jemini is a game library designed to allow creation of reusable features. How many times has someone implemented the aiming on a first person shooter, or a minimap on a real time strategy? Jemini comes packaged with lots of behaviors out of the box, with the ability to easily author more. Jemini uses Phys2D and Slick for physics and graphics, with 3D on the roadmap.","A CYOA game engine","Metro is a 2D Gaming framework built around gosu (game development library). Metro makes it easy to create games by enforcing common conceptual structures and conventions.","Written to play with Ruby","Clean and powerful library for game programming"],"Natural Language Date Parsing":["Chronic is a natural language date/time parser written in pure Ruby.","chronic_between","A simple Ruby natural language parser for elapsed time. (For example, 4 hours and 30 minutes, 6 minutes 4 seconds, 3 days, etc.) Returns all results in seconds. Will return an integer unless you get tricky and need a float. (4 minutes and 13.47 seconds, for example.) The reverse can also be performed via the output method.","A dirt simple library for parsing and formatting human readable dates","Extracts date, time, and message information from naturally worded text.","Includes a parse method on String object","Tickle is a date/time helper gem to help parse natural language into a recurring pattern. Tickle is designed to be a compliment of Chronic and can interpret things such as \"every 2 days, every Sunday, Sundays, Weekly, etc."],"Ruby Version Management":["Changes the current Ruby","Pik is a tool to manage multiple versions of ruby on Windows. It can be used from the Windows command line (cmd.exe), Windows PowerShell, or Git Bash. I have yet to test on cygwin. \u003Epik help commands add Adds another ruby location to pik. benchmark|bench Runs bencmarks with all versions that pik is aware of. checkup|cu Checks your environment for current Ruby best practices. config Adds/modifies configuration options. default Switches back to the default settings. gem Runs the gem command with all versions that pik is aware of. gemsync Synchronizes gems from the version specified to the current version. help Displays help information. implode Removes your pik configuration. info Displays information about the current ruby version. install|in Downloads and installs different ruby versions. list|ls Lists ruby versions that pik is aware of. rake Runs the rake command with all versions that pik is aware of. remove|rm Removes a ruby location from pik. ruby|rb Runs ruby with all versions that pik is aware of. run Runs command with all versions of ruby that pik is aware of. switch|sw|use Switches ruby versions based on patterns. tag Adds the given tag to the current version. tags Runs the pik command against the given tags. uninstall|unin Deletes a ruby version from the filesystem and removes it from Pik. update|up updates pik. For help on a particular command, use 'pik help COMMAND'.","Groom your app’s Ruby environment","Minimal Ruby version management is minimal.","Compile and install Ruby","RVM ~ Ruby Environment Manager ~ Ruby Gem Library.","use rvm to manage ruby versions within emacs","which_ruby is a simple helper for checking running Ruby engine"],"Image Processing":["This pure Ruby library can read and write PNG images without depending on an external image library, like RMagick. It tries to be memory efficient and reasonably fast. It supports reading and writing all PNG variants that are defined in the specification, with one limitation: only 8-bit color depth is supported. It supports all transparency, interlacing and filtering options the PNG specifications allows. It can also read and write textual metadata from PNG files. Low-level read/write access to PNG chunks is also possible. This library supports simple drawing on the image canvas and simple operations like alpha composition and cropping. Finally, it can import from and export to RMagick for interoperability. Also, have a look at OilyPNG at http://github.com/wvanbergen/oily_png. OilyPNG is a drop in mixin module that implements some of the ChunkyPNG algorithms in C, which provides a massive speed boost to encoding and decoding.","Simple image manipulation using Apple's Core Image technology. Scale, rotate, flip, convert, overlay, and more.","Ruby bindings for DevIL cross platform image loading library","ImageScience is a clean and happy Ruby library that generates thumbnails -- and kicks the living crap out of RMagick. Oh, and it doesn't leak memory like a sieve. :) For more information including build steps, see http://seattlerb.rubyforge.org/","A ruby ImageMagick/GraphicsMagick library that doesn't suck","a library for automated lossless image optimization","RMagick replacement which uses ImageMagick directly by constructing chainable commands","A service for image manipulation - built as an extensible wrapper of Imagemagick which handles caching, c/o the Dragonfly gem.","Manipulate images with minimal use of memory via ImageMagick / GraphicsMagick","Simple Ruby stateless module interface to imagemagick.","paperclip-optimizer is a processor for Paperclip that allows you to optimize and minify uploaded JPEG and PNG files.","RMagick is an interface between Ruby and ImageMagick.","Thin ImageMagick DSL with smart command composition"],"Scheduling":["A scheduler process to replace cron, using a more flexible Ruby syntax running as a single long-running process. Inspired by rufus-scheduler and resque-scheduler.","A Rails plugin for managing and installing rake-centric crontab files.","Task scheduler that doesn't need to bootstrap your Rails environment every time it executes a task the way running a rake task via cron does.","Light weight job scheduling on top of Resque. Adds methods enqueue_at/enqueue_in to schedule jobs in the future. Also supports queueing jobs on a fixed, cron-like schedule.","job scheduler for Ruby (at, cron, in and every jobs).","A simple task scheduler for rails","Clean ruby syntax for writing and deploying cron jobs."],"Presentation Software":["Create live-coding HTML5-based presentations and workshops","CSS-based SlideShow System","No need for Keynote or PowerPoint anymore, use a browser to give presentations","S6 Blank - Slide Show Templates Using HTML5, CSS3 \u0026 JavaScript (w/ jQuery)","ShowOff is a Sinatra web app that reads simple configuration files for a presentation. It is sort of like a Keynote web app engine. I am using it to do all my talks in 2010, because I have a deep hatred in my heart for Keynote and yet it is by far the best in the field. The idea is that you setup your slide files in section subdirectories and then startup the showoff server in that directory. It will read in your showoff.json file for which sections go in which order and then will give you a URL to present from.","Create slides with Markdown","The Slide Show (S9) Ruby gem lets you create slide shows and author slides in plain text\r using a wiki-style markup language that's easy-to-write and easy-to-read.\r The Slide Show (S9) project also collects and welcomes themes and ships\r \"out-of-the-gem\" with built-in support for \"loss-free\" gradient vector graphics themes.\r \r ~~~\r SYNOPSIS\r slideshow [global options] command [command options] [arguments...]\r \r VERSION\r 2.0.0\r \r GLOBAL OPTIONS\r -c, --config=PATH - Configuration Path (default: ~/.slideshow)\r --verbose - (Debug) Show debug messages\r --version - Show version\r \r COMMANDS\r build, b - Build slideshow\r install, i - Install template pack\r list, ls, l - List installed template packs\r new, n - Generate quick starter sample\r about, a - (Debug) Show more version info\r help - Shows a list of commands or help for one command\r ~~~"],"Recommendation Engines":["An awesome, flexible, powerful, useful, tricky and liar Rails 3 recommendations engine.","A Like/Dislike recommendation engine for Ruby apps using Redis.","Recommendify is a distributed, incremental item-based recommendation engine for binary input ratings. It's based on ruby and redis and uses an approach called \"Collaborative Filtering\"","A ruby library to find similar objects and make recommendations based on activity of objects","Implementation of the weighted Slope One collaborative filtering/recommendation algorithm."],"Testing Rails Engines":["Test your Rails Engines without needing a full Rails app","Creates a Rails 3 engine configuration with multiple dummy apps and test framework configured and ready to go","Allows you to easily implement testing for a Rails engine and have it execute in the context of a dummy test app."],"Test::Unit Extensions":["Write declarative tests using nested contexts without performance penalties. Contest is less than 100 lines of code and gets the job done.","A super tight library to add contexts to tests.","pending lets you define a block of test code that is currently \"pending\" functionality, similar to RSpec's pending method.","Making tests easy on the fingers and eyes"],"Packaging Systems":["Hacker's toolbelt for Ruby, gems, Bundler, git, and more","Rip: Ruby's Intelligent Packaging","Fast ruby package management for unix","RubyGems is a package management framework for Ruby. This gem is an update for the RubyGems software. You must have an installation of RubyGems before this update can be applied. See Gem for information on RubyGems (or `ri Gem`) To upgrade to the latest RubyGems, run: $ gem update --system # you might need to be an administrator or root See UPGRADING.rdoc for more details and alternative instructions. ----- If you don't have RubyGems installed, you can still do it manually: * Download from: https://rubygems.org/pages/download * Unpack into a directory and cd there * Install with: ruby setup.rb # you may need admin/root privilege For more details and other options, see: ruby setup.rb --help","SlimGems is a drop-in replacement for RubyGems, a package management framework for Ruby. This project was forked at 1.3.7, which was a great stable release. SlimGems focuses on maintaining a sane and stable API. We believe that the project has been put through enough stress testing by the community to lock into the current API functionality for the forseeable future. We will also continue to improve the runtime performance over time; we can do this without changing the API."],"CouchDB Clients":["CouchFoo provides an ActiveRecord API interface to CouchDB","Ruby persistence layer for CouchDB","CouchRest provides a simple interface on top of CouchDB's RESTful HTTP API, as well as including some utility scripts for managing views and attachments.","CouchRest Model provides aditional features to the standard CouchRest Document class such as properties, view designs, associations, callbacks, typecasting and validations.","A Rails plugin for connecting to and working with CouchDB via CouchRest","A Ruby library for generating identicon. https://github.com/swdyh/quilt","RelaxDB provides a simple interface to CouchDB","Convenience layer for CouchDB on top of CouchPotato.","A Rails plugin to read and write CouchDB documents via Activerecord"],"JSON Parsers":["Really simple JSON and XML parsing, ripped from Merb and Rails.","This is a JSON implementation as a Ruby extension in C.","A JSON implementation as a JRuby extension. You may now use the json gem directly.","This is a JSON implementation in pure Ruby.","A common interface to multiple JSON libraries, including Oj, Yajl, the JSON gem (with C-extensions), the pure-Ruby JSON gem, NSJSONSerialization, gson.rb, JrJackson, and OkJson.","The fastest JSON parser and object serializer.","Ruby C bindings to the excellent Yajl JSON stream-based parser library."],"Packaging to Executables":["Crate is a developer tool to help package up your application as a custom static build of the ruby interpreter plus all dependent binary extensions. All the pure ruby code (the ruby application, the ruby stdlib, etc ) is packed into one or more SQLite databases. The final distributable pieces are a single executable and a few SQLite databases which can be then wrapped up appropriately as an OS X App; a self extracting executable for Windows; a shar archive, rpm or tarball for Unixes.","OCRA (One-Click Ruby Application) builds Windows executables from Ruby source code. The executable is a self-extracting, self-running executable that contains the Ruby interpreter, your source code and any additionally needed ruby libraries or DLL.","Releasy helps to make Ruby application releases simpler, by creating and archiving source folders, Windows folders, standalone executables, installers and OS X app bundles.","A Ruby Compiler"],"Cucumber Tools":["Lazy coverage-aware running of Cucumber acceptance tests","Prompt for writing Cucumber tests","Cucumber-In-The-Yard is a YARD extension that processes Cucumber Features, Scenarios, Steps, Step Definitions, Transforms, and Tags and provides a documentation interface that allows you easily view and investigate the test suite. This tools hopes to bridge the gap of being able to provide your feature descriptions to your Product Owners and Stakeholders.","cucumber-nagios helps you write behavioural tests for your systems and infrastructure, that can be plugged into Nagios.","Mimics the functionality of minitest/pride for Cucumber","Extension for Cucumber (http://cukes.info/) that makes it easy to take HTML snapshots and also to use Webkit to capture PNG screenshots of your web application during tests","This little gem will help you to initialize a cucumber environment for a sinatra application. It will generate the required files from templates.","A ruby library used to root out smells in your cukes.","Scrapes Cucumber *.feature files to build reports on tag usage and test inventory","Stepdown allows you to see where your most used Cucumber steps are, your unused steps and how they are clustered","Cucumber formatter for easily viewing each step of your scenarios","YARD-Cucumber is a YARD extension that processes Cucumber Features, Scenarios, Steps, Step Definitions, Transforms, and Tags and provides a documentation interface that allows you easily view and investigate the test suite. This tools hopes to bridge the gap of being able to provide your feature descriptions to your Product Owners and Stakeholders."],"Template Engines":["A view layer for your Rails apps that separates structure and logic.","Deface is a library that allows you to customize ERB, Haml and Slim views in a Rails application without editing the underlying view.","Ember (EMBEdded Ruby) is an [eRuby] template processor that allows\r debugging, reduces markup, and improves composability of eRuby templates.","Erector is a Builder-like view framework, inspired by Markaby but overcoming some of its flaws. In Erector all views are objects, not template files, which allows the full power of object-oriented programming (inheritance, modular decomposition, encapsulation) in views.","Erubis is an implementation of eRuby and has the following features: * Very fast, almost three times faster than ERB and about 10% faster than eruby. * Multi-language support (Ruby/PHP/C/Java/Scheme/Perl/Javascript) * Auto escaping support * Auto trimming spaces around '\u003C% %\u003E' * Embedded pattern changeable (default '\u003C% %\u003E') * Enable to handle Processing Instructions (PI) as embedded pattern (ex. '\u003C?rb ... ?\u003E') * Context object available and easy to combine eRuby template with YAML datafile * Print statement available * Easy to extend and customize in subclass * Ruby on Rails support","Haml (HTML Abstraction Markup Language) is a layer on top of HTML or XML that's designed to express the structure of documents in a non-repetitive, elegant, and easy way by using indentation rather than closing tags and allowing Ruby to be embedded with ease. It was originally envisioned as a plugin for Ruby on Rails, but it can function as a stand-alone templating engine.","Fast extensible ruby html5 builder","Compile Handlebars templates in the Rails asset pipeline.","Inversion is a templating system for Ruby. It uses the \"Inversion of Control\" principle to decouple the contents and structure of templates from the code that uses them, making it easier to separate concerns, keep your tests simple, and avoid polluting scopes with ephemeral data.","Safe user-template system written in Ruby","A secure, non-evaling end user template engine with aesthetic markup.","_why's markaby templating language","Multipart templates made easy with Markdown + ERb","Inspired by ctemplate, Mustache is a framework-agnostic way to render logic-free views. As ctemplates says, \"It emphasizes separating logic from presentation: it is impossible to embed application logic in this template language. Think of Mustache as a replacement for your views. Instead of views consisting of ERB or HAML with random helpers and arbitrary logic, your views are broken into two parts: a Ruby class and an HTML template.","A simple templating system for Web sites.","ParseTree meets Markaby","A Template-Engine inspired by the jinja engine","Slim is a template language whose goal is reduce the syntax to the essential parts without becoming cryptic.","Sweet is a pre-compiled language based on Ruby and Python. Sweet makes possible to use all the class, defs, conditionals, global and local variables power of server-side languages, defining blocks by indentation like Python in your Sweet HTML markup. It comes with a SIC ( Sweet Interactive Console ) the you can test your code and ideas before really right and compile it.","tagz.rb is generates html, xml, or any sgml variant like a small ninja running across the backs of a herd of giraffes swatting of heads like a mark-up weedwacker. weighing in at less than 300 lines of code tagz.rb adds an html/xml/sgml syntax to ruby that is both unobtrusive, safe, and available globally to objects without the need for any builder or superfluous objects. tagz.rb is designed for applications that generate html to be able to do so easily in any context without heavyweight syntax or scoping issues, like a ninja sword through butter.","Template compilation framework in Ruby","Generic interface to multiple Ruby template engines","WLang is a general-purpose *code generation*/*templating engine*. It's main aim is to help you generating web pages, sql queries, ruby code (that is, generating text in general) without having to worry too much about html entities encoding, sql back quoting, string escaping and the like. WLang proposes a generic engine that you can easily extend to fit your needs. It also proposes standard instantiations of this engine for common tasks such as rendering HTML web pages."],"Rails Controller Abstractions":["Control the traffic of your rails controllers.","DecentExposure helps you program to an interface, rather than an implementation in your Rails controllers. The fact of the matter is that sharing state via instance variables in controllers promotes close coupling with views. DecentExposure gives you a declarative manner of exposing an interface to the state that controllers contain and thereby decreasing coupling and improving your testability and overall design.","Inherited Resources speeds up development by making your controllers inherit all restful actions so you just have to focus on what is important.","Controller abstractor for Rails","Rails 3 and above: redirect after user has clicked the back button, e.g. to edit the newly created record instead of creating a new one.","Rails RESTful controller abstraction plugin.","resources_controller rails plugin: rc makes RESTful controllers fun","Toast is an extension to Ruby on Rails that lets you expose any ActiveRecord model as a resource according to the REST paradigm via a generic controller. The default representation format is JSON or can be anything"],"Daemon Management":["A library for robust daemon management.","With daemon-spawn you can start, stop and restart processes that run in the background. Processed are tracked by a simple PID file written to disk.","Process manager for applications with multiple components","Friendly wrapper around launchctl"],"HTTP Pub/Sub":["Private pub/sub messaging in Rails through Faye. More Faye features supported. Based on PrivatePub.","EventMachine based WebSocket server","Simple pub/sub messaging for the web","Faye bindings for Rails 3.1+.","Universal Ruby library to handle WebSocket protocol","Private pub/sub messaging in Rails through Faye.","Socky is a WebSocket server and client for Ruby","Universal Ruby library to handle WebSocket protocol","Rack-based WebSocket server"],"XML Mapping":["Data Active is an extension of ActiveRecord that provides features to synchronise an ActiveRecord Model with a supplied XML document","Gyoku translates Ruby Hashes to XML","object to xml mapping library","Object to XML Mapping Library, using Nokogiri (fork from John Nunemaker's Happymapper)","XML to Hash translator","Builds XML and JSON representations of your Ruby objects","ROXML is a Ruby library designed to make it easier for Ruby developers to work with XML. Using simple annotations, it enables Ruby classes to be mapped to XML. ROXML takes care of the marshalling and unmarshalling of mapped attributes so that developers can focus on building first-class Ruby classes. As a result, ROXML simplifies the development of RESTful applications, Web Services, and XML-RPC.","Saxerator is a streaming xml-to-hash parser designed for working with very large xml files by giving you Enumerable access to manageable chunks of the document.","Declarative SAX Parsing with Nokogiri","A streaming XML parser which builds objects and passes them to a collecter as they are ready. Based upon Nokogiri SAX parsing functionality.","Saxy finds object definitions in XML files and translates them into Ruby objects. It uses SAX parser under the hood, which means that it doesn't load the whole XML file into memory. It goes once though it and yields objects along the way.","Robust XML parser that allows defining desired behavior with fancy DSL","XML Active is an extension of ActiveRecord that provides features to synchronise an ActiveRecord Model with a supplied XML document","Inspired by the Gyoku gem for hash to xml conversion, XmlFu is designed to require no meta tagging for node attributes and content. (i.e. no :attributes! and no :order!)","An easy to use, extensible library for mapping Ruby objects to XML and back. Includes an XPath interpreter."],"Table Builders":["This allows you to easily build datagrid aka data tables with sortable columns and filters","HTML tables made easy (in Rails 4)","Enables easy table rendering in rails applications","Gridder generates a html table.","Displays a collection (ActiveRelation or Array-like object) wrapped in an html table with server side column sorting, filtering hooks, and search bar. Large collections can be paginated with either the will_paginate gem or kaminari gem if you use them, or a naive Enumerable based paginator (without pager links) if neither is present.","A Rails table builder made to easily create table or sort a table. The syntax is simple to write and easy to read.","Rails tables builder gem that makes creating tables painless. Includes ability to write custom column formatters or even customize row completely. Includes library of predefined column formatters. Also has ability to generate \"totals\" row.","Table Cloth helps you create tables easily.","A DSL for Rails that provides easy table creation with sorting and filtering.","table-for is a table builder for an array of objects, easily allowing overriding of how any aspect of the table is generated","This gem builds HTML-table using given array","simple, flexible and fast html table generator","A table builder for active record collections that produces semantically rich and accessible table markup","A Rails grid plugin to create grids with sorting, pagination, and (automatically generated) filters.One of the goals of this plugin was to allow the programmer to define the contents of the cell by himself, just like one does when rendering a collection via a simple table (and this is what differentiates WiceGrid from various scaffolding solutions), but automate implementation of filters, ordering, paginations, CSV export, and so on. Ruby blocks provide an elegant means for this."],"Distributed Testing":["Parallel and Distributed Test Runner for Ruby","Project Hydra Stack Dependencies","Run Test::Unit / RSpec / Cucumber / Spinach in parallel","RSpec extensions for parallel, distributed execution across hosts, using DRb and Rinda","Specjour splits your RSpec suite across multiple machines, and multiple cores per machine, to run super-parallel-fast! Also works with Cucumber.","Spin preloads your Rails environment to speed up your autotest(ish) workflow. By preloading your Rails environment for testing you don't load the same code over and over and over... Spin works best for an autotest(ish) workflow.","A forking Drb spec server","Rails application preloader","Testbot is a test distribution tool that works with Rails, RSpec, RSpec2, Test::Unit and Cucumber.","Distributed test running with autodiscovery via Bonjour (for Cucumber first)","minitest/rspec parallel test runner for CI environments","Boot any rails app in under a second","Integration for zeus and parallel_tests"],"Time Warping":["Delorean lets you travel in time with Ruby by mocking Time.now","Righting wrongs in your test suite with time travel!","A gem providing \"time travel\" and \"time freezing\" capabilities, making it dead simple to test time-dependent code. It provides a unified method to mock Time.now, Date.today, and DateTime.now in a single call.","A Rails plugin that makes it easy to write tests or specs for time-dependent code","TimeWarp is a ruby library for manipulating times in automated tests.","Warp time zones in your tests."],"Deprecation Tools":["An easy way to handle deprecating and conditionally running deprecated code","This is an implementation of Daniel Berger's proposal of structured warnings for Ruby."],"URL Rewriting":["Desviar provides URL redirection; some possible applications include: - Web signup process - Continuous-deploy servers - Online ticket sales","A rack middleware for enforcing rewrite rules. In many cases you can get away with rack-rewrite instead of writing Apache mod_rewrite rules.","Redirect is a simple Ruby redirect DSL build on Rack. It's like a simple Ruby mod_rewrite, so you can write and test your redirects in Ruby.","Reflection is a Rails plugin and standalone Rack middleware library. Give up quirky config syntax and use plain old Ruby for your rewrite and redirection rules."],"Web servers":["A Web Server","Hoof is linux variant of pow. It's based on nss, eventmachine and unicorn","A small fast HTTP library and server that runs Rails, Camping, Nitro and Iowa apps.","Ruby-Mongrel2 is a complete Ruby connector for Mongrel2[http://mongrel2.org/]. This library includes configuration-database ORM classes, a Ruby implementation of the 'm2sh' tool, a configuration DSL for generating config databases in pure Ruby, a Control port interface object, and handler classes for creating applications or higher-level frameworks.","A modern web server and application server for Ruby, Python and Node.js, optimized for performance, low memory usage and ease of use.","Manipulating files and directories in Ruby is boring and tedious -- it's missing POW! Pow treats files and directories as ruby objects giving you more power and flexibility.","Puma is a simple, fast, threaded, and highly concurrent HTTP 1.1 server for Ruby/Rack applications. Puma is intended for use in both development and production environments. In order to get the best throughput, it is highly recommended that you use a Ruby implementation with real threads like Rubinius or JRuby.","Simple, upgradable WebSockets for Thin.","A thin and fast web server","Trinidad allows you to run Rails or Rack applications within an embedded Apache Tomcat container. Serves your requests with the elegance of a cat !","\\Unicorn is an HTTP server for Rack applications designed to only serve fast clients on low-latency, high-bandwidth connections and take advantage of features in Unix/Unix-like kernels. Slow clients should only be served by placing a reverse proxy capable of fully buffering both the the request and response in between \\Unicorn and slow clients.","A multi-process web-server written in Ruby 1.9."],"Exchange Clients":["Exchange Web Services API. It doesn't use soap4r.","Ruby library for accessing Microsoft Exchange using Exchange Web Services","an email focussed Ruby client for Exchange Web Services atop Savon","Connect, browse, and iterate through folders and messages on an Exchange Server","A Ruby client access library for Microsoft Exchange Web Services (EWS). Examples can be found here: http://distributed-frostbite.blogspot.com"],"JavaScript Runtimes":["ExecJS lets you run JavaScript code from Ruby.","Call JavaScript code and manipulate JavaScript objects from Ruby. Call Ruby code and manipulate Ruby objects from JavaScript."],"git Tools":["EZGit is a simple interface for working with git repositories","Gas is a utility to keep track of your git authors. Add them to gas and switch at any time. Great if you use one author at work and one at home or if you are doing pair programming. Is extendable with own commands.","An interactive way to learn git.","This gem is designed to provide a Ruby interface to the gitolite git backend system. This gem aims to provide all management functionality that is available via the gitolite-admin repository (like SSH keys, repository permissions, etc)","User management and pairing for Git","Grit is a Ruby library for extracting information from a git repository in an object oriented manner.","Gritano is a tool to configure git servers over ssh","An octolicious wrapper around the Gitignore Templates API.","Ruby/Git is a Ruby library that can be used to create, read and manipulate Git repositories by wrapping system calls to the git binary.","Rugged is a Ruby bindings to the libgit2 linkable C Git library. This is for testing and using the libgit2 library in a language that is awesome."],"Subscription Management":["Ruby lib for using the FastSpring (Saas) subscription management API","Subscription management and processing (TrustCommerce, BrainTree, etc.)","Billing for rack apps","This was purpose built to extend models with subscriptions that were controlled via SalesForce","SubscriptionFu helps with building services which have paid subscriptions. It includes the models to store subscription status, and provides integration with PayPal for paid subscriptions."],"Atom \u0026 RSS Feed Parsing":["A simple, flexible, and extensible RSS and Atom parser for Ruby. Based on the popular SimpleRSS library, but with many nice extra features.","Nice and simple RSS and atom feed parsing built on hpricot","An extensible Ruby wrapper for Atom and RSS parsers. Feed normalizer wraps various RSS and Atom parsers, and returns a single unified object graph, regardless of the underlying feed format.","Rss and Atom feed parser with sanitizer support built on top of Nokogiri.","Feedtosis finds new information in feeds quickly using smart fetching and matching of previously read entries","A library designed to retrieve and parse feeds as quickly as possible","ruby lib to access OPDS feeds","A command line tool to download opds feeds","A fast Atom Syndication and Publication API based on libxml","Parse RSS and Atom feeds in Ruby","Enables standard bundled RSS library parse and make feeds including \"Feed Paging and Archiving\"(RFC 5005).","Enables standard bundled RSS library parse and make feeds including DCMI(Dublin Core Metadata Initiative) Metadata Terms","boost up your RSS related applications with the motor available: https://github.com/abhishekkr/rubygem_rss_motor/blob/master/README","Enable starndard bundled RSS library to use Nokogiri as a parser.","OPDS parser and maker","Ruby library to parse ATOM and RSS feeds","A simple, flexible, extensible, and liberal RSS and Atom reader for Ruby. It is designed to be backwards compatible with the standard RSS parser, but will never do RSS generation.","Syndication is a parser for RSS and Atom feeds. It uses either REXML or its built-in \"tag soup\" parser for feed parsing. It supports extensions \\ to web feeds including Dublin Core metadata, Apple iTunes podcasts, and extensions from Google and Feedburner. It is written in pure Ruby, and designed to be easy to understand and extend. It is compatible with Ruby 1.8.x and 1.9.x."],"E-Mail Processing":["download email from POP3 or IMAP and do stuff with it.","SendGrid Parse API client Rails Engine","A plugin for accessing POP3/IMAP accounts in rails","Mailman makes it easy to process incoming emails with a simple routing DSL","mail_room will proxy email (gmail) from IMAP to a delivery method","A microframework for mail-centric applications","Sortah provides a simple, declarative internal DSL for sorting your email. It provides an executable which may serve as an external mail delivery agent for such programs as `getmail`. Finally, since your sorting logic is just Plain Old Ruby Code (PORC, as I like to call it). You have access to 100% of ruby as needed, including all of it's object oriented goodness, it's wonderful community of gems, and it's powerful metaprogramming ability. \\","Handling e-mail attachments with MIME type 'application/ms-tnef'"],"GUI Frameworks":["Pure Ruby FFI wrapper for the Tk GUI toolkit.","FXRuby is the Ruby binding to the FOX GUI toolkit.","monkeybars","qtbindings provides ruby bindings to QT4.x. It is derived from the kdebindings project.","Ruby/GTK2 is a Ruby binding of GTK+-2.x.","Shoes is the best little GUI toolkit for Ruby. This gem is currently a placeholder until we properly gemfiy Shoes.","wxRuby allows the creation of graphical user interface (GUI) applications via the wxWidgets library. wxRuby provides native-style GUI windows, dialogs and controls on platforms including Windows, OS X and Linux."],"Font-Face Servers":["Pow. Right in the kisser.","Fontue is a Rack-based, open-source, web font server built for Kernest.com. This project also includes font optimization scripts for use with FontForge","Sinatra app for serving web fonts easily with proper caching and access-control headers"],"CLI Progress Bars":["the instafailing RSpec progress bar formatter","Displays multiple progress bars using Ncurses. Useful for displaying the status of multiple test runs, say, distributed across different machines. Which is exactly why I wrote it.","The last progressbar-library you'll ever need","Show progress of long running tasks","Ruby/ProgressBar is a text progress bar library for Ruby. It can indicate progress with percentage, a progress bar, and estimated remaining time.","Give people feedback about long-running tasks without overloading them with information: Use a progress bar, like Curl or Wget!","Print progress reports for loops, like the Smart::Comments package in perl.","Ruby/ProgressBar is an extremely flexible text progress bar library for Ruby. The output can be customized with a flexible formatting system including: percentage, bars of various formats, elapsed time and estimated time remaining.","Gem provides animated spinner for UNIX shell and could be used with rake tasks and any console scripts","Spinning Cursor is a flexible DSL that allows you to easily produce a customizable waiting/loading message for your Ruby command line program. Beautifully keep your users informed with what your program is doing when a more complex solution, such as a progress bar, doesn't fit your needs."],"Web Analytics":["Easy server-side tracking for Google Analytics","Easy server-side tracking for Google Analytics","Google Analytics' Event Tracking everywhere in your Rails app","Google Analytics API Ruby Wrapper","Gattica is a Ruby library for extracting data from the Google Analytics API.","Rails 3 helpers to manage google analytics tracking","Ruby gem for fetching Google PageRank\u0026#174;","Access the Google Analytics Core Reporting and Management APIs with Ruby. Create models for metrics and dimensions. Filter your data to tell you what you need.","Track stuff using javascript from your controllers, even after redirects","Easy way to retrieve Google Page Rank, Alexa Rank, backlink counts, and index counts.","Embeds the Clicky tracking code at the end of your HTML","Simple Rack middleware for implementing google analytics tracking in your Ruby-Rack based project. Supports synchronous and asynchronous insertion and configurable load options.","Rugalytics is a Ruby API for Google Analytics.","World Wide Web's Trolls and Flaws giving varied Trolls \u0026 Flaws analyzing the BAD WWW around.","Yaga is yet another Google Analytics integration for your rails app. It supports multiple environments, custom variables, events and anonymizeIP."],"Gem and Library Inspection":["A utility to view a gem's source in your favorite editor","Open a gem's source directory with either the default editor, or a specified command.","Open a gem or library's source directory with your default editor."],"Gem Hosting":["Cloud Gem Server for your private RubyGems at http://gemfury.com","A sinatra based gem hosting app, with client side gem push style functionality.","Stickler is a tool to organize and maintain an internal gem repository. Primarily, you would want to use Stickler if: 1. You have proprietary gems that you want to have available via a gem server so you may `gem install` them. 2. You would like to have a local mirror of third party gems from either http://rubygems.org or some other gem server. 3. You want both (1) and (2) in the same server."],"SOAP Clients":["Handsoap is a library for creating SOAP clients in Ruby","A library for dealing with SOAP requests and responses. We tear our hair out so you don't have to.","Heavy metal SOAP client","Lightweight SOAP library for Ruby"],"HTML parsing":["a swift, liberal HTML parser with a fantastic library","The Libxml-Ruby project provides Ruby language bindings for the GNOME Libxml2 XML toolkit. It is free software, released under the MIT License. Libxml-ruby's primary advantage over REXML is performance - if speed is your need, these are good libraries to consider, as demonstrated by the informal benchmark below.","Extract useful data from HTML and XML with ease!","Nokogiri (é¸) is an HTML, XML, SAX, and Reader parser. Among Nokogiri's many features is the ability to search documents via XPath or CSS3 selectors. XML is like violence - if it doesnât solve your problems, you are not using enough of it.","scrAPI is an HTML scraping toolkit for Ruby. It uses CSS selectors to write easy, maintainable scraping rules to select, extract and store data from HTML content.","scRUBYt! is an easy to learn and use, yet powerful and effective web scraping framework. It's most interesting part is a Web-scraping DSL built on HPricot and WWW::Mechanize, which allows to navigate to the page of interest, then extract and query data records with a few lines of code. It is hard to describe scRUBYt! in a few sentences - you have to see it for yourself!","A new short XML Parsing Algorithm implemented directly in less-than-500 lines. An easy-to-use XML Parser without any Native Dependencies. Its under continuous improvement as being used/tested under my other xml-parsing required projects. [What, Why, HowTo]: http://justfewtuts.blogspot.in/2012/03/xml-motor-what-it-is-how-why-should-you.html"],"Microformats":["A unified interface to the semantic web. You tell your ERB/Haml this is a \"person\" object, and it will give you the schema.org microdata, the microformats, or both. Cuts out having to remember these \"non-human\" keys :).","Microformats Helper is a gem for generating content-rich tags in HTML files, following Microformats standards. For more information about Microformats, check its website (http://microformats.org).","mofo is a ruby microformat parser","A Ruby microformat parser and HTML toolkit powered by Nokogiri"],"SQL Database Adapters":["Rails Driver and Adapter for IBM Data Servers: {DB2 on Linux/Unix/Windows, DB2 on zOS, DB2 on i5/OS, Informix (IDS)}","Install this gem `require 'jdbc/mysql'` and invoke `Jdbc::MySQL.load_driver` within JRuby to load the driver.","Install this gem `require 'jdbc/postgres'` and invoke `Jdbc::Postgres.load_driver` within JRuby to load the driver.","Simple gem that makes working with raw MySQL in Ruby efficient and fun! It's basically a query string builder (not an ORM!) that takes care of sanatization and sql chaining.","This is the MySQL API module for Ruby. It provides the same functions for Ruby programs that the MySQL C API provides for C programs. This package is offered as gem for easy installation using RubyGems. It wraps unmodified tmtm's mysql-ruby extension into a proper gem. Please note that tmtm (Tomita Mashahiro) has deprecated development of this extension and only update it for bug fixes.","A simple, fast Mysql library for Ruby, binding to libmysql","Enhanced Ruby MySQL driver","Pg is the Ruby interface to the {PostgreSQL RDBMS}[http://www.postgresql.org/]. It works with {PostgreSQL 8.4 and later}[http://www.postgresql.org/support/versioning/]. A small example usage: #!/usr/bin/env ruby require 'pg' # Output a table of current connections to the DB conn = PG.connect( dbname: 'sales' ) conn.exec( \"SELECT * FROM pg_stat_activity\" ) do |result| puts \" PID | User | Query\" result.each do |row| puts \" %7d | %-16s | %s \" % row.values_at('procpid', 'usename', 'current_query') end end","A pure Ruby interface to the PostgreSQL (\u003E= 7.4) database","PostgreSQL Cursor is an extension to the ActiveRecord PostgreSQLAdapter for very large result sets. It provides a cursor open/fetch/close interface to access data without loading all rows into memory, and instead loads the result rows in \"chunks\" (default of 10_000 rows), buffers them, and returns the rows one at a time.","This is MySQL connector. pure Ruby version","ruby-oci8 is a ruby interface for Oracle using OCI8 API. It is available with Oracle8i, Oracle9i, Oracle10g, Oracle11g and Oracle Instant Client.","This module allows Ruby programs to interface with the SQLite3 database engine (http://www.sqlite.org). You must have the SQLite engine installed in order to build this module. Note that this module is only compatible with SQLite 3.6.16 or newer.","This module allows Ruby programs to interface with the SQLite3 database engine (http://www.sqlite.org). You must have the SQLite engine installed in order to build this module. Note that this module is NOT compatible with SQLite 2.x."],"Recurring Events":["scheduler written in ruby to execute ruby code from (recurring) events on an ical calendar URL or file","ice_cube is a recurring date library for Ruby. It allows for quick, programatic expansion of recurring date rules.","A JRuby implementation of RFC 2445 (ical) recurrence rule","A simple library to handle recurring events","Recurring allows you to define Schedules, which can tell you whether or not a given Time falls in the Schedule, as well as being able to return a list of times which match the Schedule within a given range.","RecurringEvent: A ruby library to aid in describing recurrent or patterned sets of dates.","A date recurrence generator for the ruby Date class","Runt is a Ruby implementation of temporal patterns by Martin Fowler. Runt provides an API for working with recurring events using set expressions.","ScheduleFu allows scheduling events with dates and times."],"Inline CSS for E-Mail":["InCurve provides some handy helper methods for your Rails app, letting you easily inline your CSS code.","Inlines CSS for html email delivery","To make your HTML display properly when stylesheet support isn't available (e.g. Gmail) this lets you attach all your CSS to the 'style' attribute of each element.","Convenient use of inline_styles gem with Rails 3.1","Making HTML emails a little less painful. Writes css inline and corrects image urls.","Packrat is a gem for merging all css rules to inline for html emails and files.","Improve the rendering of HTML emails by making CSS inline, converting links and warning about unsupported code.","This gem brings you the power of the premailer gem to Rails without any configuration needs. Create HTML emails, include a CSS file as you do in a normal HTML document and premailer will inline the included CSS.","Roadie tries to make sending HTML emails a little less painful in Rails 3 by inlining stylesheets and rewrite relative URLs for you."],"Prototype Replacements":["JQuery UI helpers you can use in your Rails apps","Using jRails, you can get all of the same default Rails helpers for javascript functionality using the lighter jQuery library.","RightRails is a RubyOnRails plugin for the RightJS JavaScript framework. It has transparent Prototype helpers replacement, a new RJS generator, the most common ajax operations interface and RightJS own features support like remote files uploading handler, UI, plugins, etc.","A Rails plugin to make it easy to use YUI on Rails instead of (or along with, I suppose) Prototype and scriptaculous"],"E-Mail Preview":["When mail is sent from your application, Letter Opener will open a preview in the browser instead of sending.","MailCatcher runs a super simple SMTP server which catches any message sent to it to display in a web interface. Run mailcatcher, set your favourite app to deliver to smtp://127.0.0.1:1025 instead of your default SMTP server, then check out http://127.0.0.1:1080 to see the mail.","Visual email testing","A mock SMTP/POP3 server to aid in the development of applications with mail functionality.","A Rails Engine to preview plain text and html email in your browser. Compatible with Rails 3 and 4.","In Rails, Sinatra, or simply the mail gem: Aids in development, testing, qa, and production troubleshooting of email issues without worrying that emails will get sent to actual live addresses."],"Asynchronous E-Mail":["Mailhopper stores your application's emails in an ActiveRecord queue for asynchronous delivery. Use Mailhopper in combination with a delivery agent such as DelayedMailhopper.","Add mails to database for background mail sending","Run a pop server serving up the current dir.","Rails plugin for sending asynchronous email with ActionMailer and Resque.","Simple asynchronous emails with Resque"],"MongoDB Clients":["Library to interact with databases, not tied to rails, and not tied to active record pattern","Object Model for MongoDB","Mongoid is an ODM (Object Document Mapper) Framework for MongoDB, written in Ruby.","A Ruby Object Mapper for Mongo","Mongomatic is a modular Ruby object mapper for Mongo","A Ruby driver for MongoDB. For more information about Mongo, see http://www.mongodb.org.","Persistence layer for Ruby objects"],"PDF Processing":["Wraps the pdfinfo command line tool to provide a hash of metadata","The PDF::Reader library implements a PDF parser conforming as much as possible to the PDF specification from Adobe","Get metadata about PDFs and extract full-quality images. Wrapper around `pdfimages` and `pdfinfo`."],"QR Codes":["Ruby Gem to generate PNG files with QR codes in them","This Gem is a wrapper around an useful open-source library for creating QR Codes, a two-dimensional bar code format popular in Japan created by the Denso-Wave Corporation in 1994.","Ruby gem QR code scanner based on ZXing","QRTools is a library for decoding QR Codes. It relies on libdecodeqr for decoding.","A ruby library to create qrcode. Output: PS, JPEG, PNG, EPS, TIFF.","rQRCode is a library for encoding QR Codes. The simple interface allows you to create QR Code data structures ready to be displayed in the way you choose.","Glues rQRCode together with chunky_png","Render QR codes with Rails 3","Ruby bindings for ZBar, a barcode recognition library. Uses FFI to interact with the underlying C library, but has no other dependencies.","Need to decode 1D/2D bars and don't mind using JRuby to help with the task? ZXing is the wrapper for you!"],"irb Alternatives":["An IRB alternative and runtime developer console","ripl is a light, modular alternative to irb. Like irb, it loads ~/.irbrc, has autocompletion and keeps history in ~/.irb_history. Unlike irb, it is highly customizable via plugins and supports commands i.e. ripl-play. This customizability makes it easy to build custom shells (i.e. for a gem or application) and complex shells (i.e. for the web). In other words, ripl is also a shell framework. Works on ruby 1.8.7 and greater."],"Maintenance Mode":["Detect and show a maintenance page","Turnout makes it easy to put your Rails application into maintenance mode"],"Rails Class Diagrams":["Ruby on Rails 3/4 model and controller UML class diagram generator. Originally based on the 'railroad' plugin and contributions of many others. (`sudo port install graphviz` before use!)","Automatically generate an entity-relationship diagram (ERD) for your Rails models."],"Visualizing Data":["JavaScript Vector Library","Ruby/Graphviz provides an interface to layout and generate images of directed graphs in a variety of formats (PostScript, PNG, etc.) using GraphViz.","Ruby-Processing is a Ruby wrapper for the Processing code art framework. It's this thin little shim that squeezes between Processing and JRuby, passing along some neat goodies like: * Application exporting of your sketches. Hand them out to your party guests, ready-to-run. * Live Coding via JRuby's IRB. Loads in your sketch so you can futz with variables and remake methods on the fly. * Bare sketches. Write your Ruby-Processing sketches without having to define a class. Without defining methods, even. * A \"Control Panel\" library, so that you can easily create sliders, buttons, checkboxes and drop-down menus, and hook them into your sketch's instance variables. * \"Watch\" mode, where Ruby-Processing keeps an eye on your sketch and reloads it from scratch every time you make a change. A pretty nice REPL-ish way to work on your Processing sketches."],"Rails Subdomains":["Rails extension to help with cookies in a system with sub-domains","A rails plugin that handles subdomain accounts","SubdomainFu is a Rails plugin to provide all of the basic functionality necessary to handle multiple subdomain applications (such as Basecamp-esque subdomain accounts and more).","SubdomainRoutes add subdomain conditions to the Rails routing system. Routes may be restricted to one or many specified subdomains. An URL will be recognised only if the host subdomain matches the subdomain specified in the route. Route generation is also enhanced, so that the subdomain of a generated URL (or path) will be changed if the requested route has a different subdomain to that of the current request. Model-based subdomain routes can also be defined.","Set of protected methods that use the subdomain as a way of identifying the current scope"]}